[
  {
    "text": "Shout out to the particular hell that is functional depression. This is me. Don’t get me wrong, it’s better than don’t-leave-my-bed-for-a-week depression. I am grateful I can be an independent person. But there is something uniquely horrible about being able to go to work every day, occasionally clean up after yourself, pay your bills, generally put yourself together enough to look like a human being... but that’s it. Nothing else. No social life. No hobbies. Constantly battling your mind. And being absolutely fucking exhausted all the time.",
    "source": "Reddit",
    "timestamp": "2019-07-14T07:53:40",
    "user_id": 850486440273111371,
    "subreddit": "depression"
  },
  {
    "text": "I hate that people don’t understand that i don’t want to kill myself, I just don’t want to be alive anymore ",
    "source": "Reddit",
    "timestamp": "2020-08-04T01:57:38",
    "user_id": 197823920414588581,
    "subreddit": "depression"
  },
  {
    "text": "If 10 years ago someone told me that in 10 years I would be routinely sitting in my room all day doing nothing to make myself a successful man but eat, sleep and use my phone/pc and sometimes go out for a lonely aimless walks, I would never believe them But here I am, 24 years old man and doing exactly that.",
    "source": "Reddit",
    "timestamp": "2019-07-12T13:36:38",
    "user_id": 5565857764774003354,
    "subreddit": "depression"
  },
  {
    "text": "It’s like I died at 15, but my body just kept on living. I’m trapped inside. Does anyone else get that feeling? My memories from the past few years are shoddy at best. I think I’m losing it.",
    "source": "Reddit",
    "timestamp": "2020-04-28T13:40:28",
    "user_id": -4811750173778845739,
    "subreddit": "depression"
  },
  {
    "text": "High-functioning depression: I feel like I'm living a double life. I read a lot of posts on here of people struggling with daily, debilitating depression that plagues every aspect of their lives, making it difficult to do small things like even take a shower. I feel that I am on the opposite side of the spectrum and wanted to share that it is equally as horrible.\n\nFrom an outsider's perspective, I appear to be a very happy and stable individual. I have a financially secure job and I go to work every day and not only try my best but actively try to get along with others and make people laugh every day. My coworkers like me, and some look up to me. No one would think I have any problems at all. However, I feel like I am hidden behind a veil, and when I come home from work and when I am in the privacy of my home, I am in such crippling depression. I have such terrible episodes of sadness. I hate myself. I over-analyze everything stupid I do or say throughout the day and I replay it in my mind constantly and belittle myself. I don't feel proud of myself for any of my accomplishments and genuinely don't know why anyone even likes me. And yet I still get up every day, live this routine, and put on a facade like I am okay. It feels like I am living a double life that I cannot escape.",
    "source": "Reddit",
    "timestamp": "2019-10-31T09:36:19",
    "user_id": -2305991409065492109,
    "subreddit": "depression"
  },
  {
    "text": "I cried in front of my family today. They ended up comparing their issues to mine and tell me that other people have it worse. Thank you, that really helps. Now I feel ten times worse.",
    "source": "Reddit",
    "timestamp": "2019-10-07T15:35:16",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "Does anyone else stay up super late to avoid the next day? I don’t know if that makes sense. What I mean is that I stay up as late as possible wasting time because I know that if I go to sleep, I’ll wake up and have to go to school. I usually go to bed at around 3:30am and get up at 6am and it’s destroying me, I’ve been doing this for months and I’m physically weak and exhausted constantly because of it but my depression and anxiety demand it. And they always seem to get their way. \n\nEdit: I’m really glad that this spoke to so many people, it feels good knowing I’m not alone. Sending lots of love to you all. This isn’t easy but I believe in you ❤️",
    "source": "Reddit",
    "timestamp": "2019-03-26T05:40:19",
    "user_id": -262873020596979838,
    "subreddit": "depression"
  },
  {
    "text": "I wouldn't commit suicide but if I had an option to suddenly stop existing I would choose it Does anyone else feel this way?  This has been crossing my mind a lot lately\n\nEDIT: I just want to thank everyone for the thoughtful, kind comments I've been recieving.  It's been a nice change and I really appreciate it.  You guys are the best.  :)",
    "source": "Reddit",
    "timestamp": "2017-09-23T20:04:15",
    "user_id": -5365163353557600358,
    "subreddit": "depression"
  },
  {
    "text": "It sucks when you wake up and the only thing you look forward to is sleeping again The first 6 words of the title is accurate too.",
    "source": "Reddit",
    "timestamp": "2021-05-10T14:07:07",
    "user_id": 2457714069547291376,
    "subreddit": "depression"
  },
  {
    "text": "When you become closed off due to depression and your friends and family start shutting you out because they think you're being mean when you are really just empty inside and don't have the energy to be happy anymore Fuck 😃",
    "source": "Reddit",
    "timestamp": "2020-09-26T14:58:05",
    "user_id": 3809760178703262179,
    "subreddit": "depression"
  },
  {
    "text": "Had anyone noticed memory decline from depression? Just curious if anyone else affected by this problem also noticed quite a big cognitive decline. Or if anyone has noticed a cognitive decline and managed to build themselves back up to that previous cognitive level.",
    "source": "Reddit",
    "timestamp": "2019-04-26T12:57:44",
    "user_id": -5706510050163245607,
    "subreddit": "depression"
  },
  {
    "text": "My therapist died She was only 67. She told me every so often about how she always thought she'd end up with her ex husband again and how she thought they were meant to be together in the end, I don't know if she ever got the chance to tell him how she felt.\n\nI'm extremely shaken up, but I think she wouldn't want me to be sad for her.\n\nIn her memory I'm going to tell the people I love how I feel, give my dog a hug, and remember that she is in my corner rooting for me when I feel like nobody else is.\n\nEdit: thanks everyone for your kind words, I feel less alone about this now. In lieu of a funeral she wanted people to donate to her dog's vet clinic because she was a huge animal lover. Maybe toss a few donations toward your local clinic or shelter to help spread her love even further",
    "source": "Reddit",
    "timestamp": "2019-09-30T15:23:27",
    "user_id": -5447755873883077915,
    "subreddit": "depression"
  },
  {
    "text": "The scary part about having depression is when you start to feel down it's hard to know if it's a temporary reaction to life or the start of a relapse Basically what the title says and my current situation.",
    "source": "Reddit",
    "timestamp": "2020-02-21T10:06:06",
    "user_id": 7401351183723348636,
    "subreddit": "depression"
  },
  {
    "text": "does anyone else have a constant feeling of not fitting in or belonging anywhere? i feel this way around everyone, friends, family, coworkers, anywhere i go. i just always feel like i’m in the background. but at the same time i like going unnoticed so i don’t have to talk to anyone and be in the spotlight..",
    "source": "Reddit",
    "timestamp": "2019-08-11T19:41:07",
    "user_id": -1219626859009887713,
    "subreddit": "depression"
  },
  {
    "text": "The worst part of depression is waking up and the first thought that pops in your head is how shitty you feel, alone and already struggling to get through the day before it’s even started. I can’t even remember the last time i woke up excited for anything.\n\nedit: Wanted to thank everyone for their kind words and sharing your own stories. Definitely glad to have this community it helps to know we aren’t alone even though it may feel that way.",
    "source": "Reddit",
    "timestamp": "2019-08-07T13:35:42",
    "user_id": -142776039159515055,
    "subreddit": "depression"
  },
  {
    "text": "Do you ever just stop dead in the middle of whatever you're doing and feel a great wave of existential dread/self-hatred Happens to me a lot. Cooking, walking to class, brushing my teeth...sometimes I just stop for like a minute, feel a tremendous sense of self-hatred and suicidal ideation, and then continue on as if nothing ever happened.",
    "source": "Reddit",
    "timestamp": "2018-03-23T15:04:15",
    "user_id": -8648793911557091283,
    "subreddit": "depression"
  },
  {
    "text": "People that aren't depressed exist and it's fuckin insane to me. Like ???\n\n\nI posted on AskReddit asking non-depressed people how they felt and I'm shocked. Not sure what I expected though.\n\n\nYou exist in this hellhole and you're just like... Chill with it? Like I'm so happy for these people but it's mindblowing! Like I have never known a time that I didn't experience severe recurring depression so it's just fuckin crazy that these people are real? One even said they don't understand how people can be depressed for seemingly no reason. Like I wish so much I could say the same.\n\n\nLike logically I knew they must exist but it's still just unfathomable in my mind. It kinda makes me sad that I don't understand them just as much as they don't understand me. But I'm glad at least someone is happy in life. Idk man.",
    "source": "Reddit",
    "timestamp": "2020-05-11T00:51:44",
    "user_id": 8389385682174921344,
    "subreddit": "depression"
  },
  {
    "text": "I’ve wasted so much time being depressed, that I’m depressed about wasting time. I can’t imagine how many days I have wasted to being sad and crying and not being able to accomplish the things I need to do. I have responsibilities I have deadlines and none of them seem to matter when I am in these dark episodes. How can you force yourself to do what needs to be done when you feel so hopeless and numb?",
    "source": "Reddit",
    "timestamp": "2020-10-24T16:46:02",
    "user_id": -6387206643569631752,
    "subreddit": "depression"
  },
  {
    "text": "Does anyone have a period where they feel really motivated and see things clearly, only to crash even harder the more you try to better yourself, feeling even more depressed than you were originally? It feels like the harder I try to better myself, the harder it pushes back.",
    "source": "Reddit",
    "timestamp": "2019-05-22T19:21:44",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "I hate how people boast about how much they support mental illness then once they meet a mentally ill person they want nothing to do with them It's just so fucking tiresome. You see it everywhere on social media. People will go on and on and on about how we should all reach out to mentally ill people then when you have the courage to reach out to them the same fucking people will tell you bullshit like \"man up\", \"stop being so sensitive\", \"hey bro at least you're not a starving child in Africa\", \"bro it's just your mindset you gotta start thinking more positively\", and so on. Like what's the fucking point. Whenever we do reach out we either get scolded or our problems get dismissed. I'm not trying to say this is how it is for everyone but this is just from my experiences. \n\nI just want someone to fucking listen just once and for once I want to be able to tell someone about this without fear of eventually getting ghosted. Is that asking for too much?",
    "source": "Reddit",
    "timestamp": "2020-11-08T04:02:49",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "Anyone else ever feel like the “old you” died years ago, and now you’re just limping along as someone you really can’t stand? Like, the old me wasn’t even that great either but damn ",
    "source": "Reddit",
    "timestamp": "2018-05-26T20:19:06",
    "user_id": -549559660872863171,
    "subreddit": "depression"
  },
  {
    "text": "Anyone keep switching from admitting to yourself that you have depression to invalidating yourself into thinking you were just playing victim? I know I have issues. But I go through manic mood swings, and while on the depressive end I feel like absolute shit, when I'm out of that phase and feel somewhat \"normal\" again I tell myself I greatly exaggerated the effect in my mind. It doesn't help that my self loathing won't let me admit that I have depression because I keep thinking I don't deserve to be depressed. So I invalidate myself and continue life until the next phase hits, and the cycle continues.",
    "source": "Reddit",
    "timestamp": "2020-05-30T01:48:29",
    "user_id": -8814590465773644082,
    "subreddit": "depression"
  },
  {
    "text": "The worst part of the depression, is that feeling, deep deep down, that the reason you're depressed is because you want to be. It's just the thought, that maybe you know how to be happy. Maybe all the stuff you read online, the stuff your family tells you, the stuff you hear from your therapist, maybe it all goes somewhere in your head. Maybe you've seen enough happy, normal functioning people, that you have some idea of how to do what they do. That maybe you've made the same mistakes enough times that you could point them out and stop repeating them.\n\nIt's the idea that, you know how not to be depressed, so if you still are, then that means you must want it this way. And if you want it this way, well that must mean you deserve it.\n\nAnd I guess, that's probably not true, but sometimes, sometimes I just don't know.",
    "source": "Reddit",
    "timestamp": "2020-10-26T19:06:20",
    "user_id": 7162167940565879673,
    "subreddit": "depression"
  },
  {
    "text": "Is anyone else strangely sick of being high functioning? I know that the fact that I can brush my teeth and shower each day and show up to work each day is a blessing with my depression. But I’m also sick of constantly feeling like I’m about to break. I hate nearly downing my pills each night only to wake up the next day to plaster a fake as smile on my face and go to work. Each night I think to myself I can’t go on like this and each day I do. Part of me just somehow wishes I completely gave up and just hit rock bottom. I don’t know. Anyone else feel the same?",
    "source": "Reddit",
    "timestamp": "2019-08-13T16:55:12",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "Becoming a regular at a local coffee shop changed my life I was depressed, failing school, etc and I decided I should do my homework at a coffee shop one day. I went in and the owner was super nice and asked me if I wanted to join the rewards program and I was really craving community at this point and I was super excited. \nI kept coming back to the shop to do my homework and the owner and the baristas would always welcome me and they were always happy to see me. I started to get to know everybody there very well and now I consider them all friends. \nI found that when depressed having different communities helps a lot, and it turns out a lot of the other regulars at coffee shops also are depressed or have other mental illnesses. \nA two dollar drink can let you stay there for a few hours and by being nice to everyone around you and being somewhat productive on work it can be a really great place to have",
    "source": "Reddit",
    "timestamp": "2019-03-31T17:13:32",
    "user_id": -2527934633829776573,
    "subreddit": "depression"
  },
  {
    "text": "How do you tell someone... I'm not ignoring you right now. I'm just disconnected from reality right now, the days are all blurred together, and I feel completely numb towards everything around me. So it's really hard for me to maintain a conversation. ",
    "source": "Reddit",
    "timestamp": "2021-01-14T15:16:17",
    "user_id": 1700043727864472198,
    "subreddit": "depression"
  },
  {
    "text": "Isn't it amazing that everyone who's never had depression, or lives an extremely happy and successful life tries to tell you how to cure depression :) It's always some great 1 off line that they think is the secret to fixing everything.\n\n\n\"Just love yourself!\" - Sure let me just go do that real quick.\n\n\n\"You have so much more time, things will get better!\" - Lot more time for things to get worse too :)\n\n\n\"You'd be disappointing your family, etc\" - Ah yes, by trapping me in the hypothetical mental state of permanently worrying about others over myself, I now get to live a happy and successful life, thank you.\n\n\n\nReally appreciate it, thank you.",
    "source": "Reddit",
    "timestamp": "2021-03-16T03:27:37",
    "user_id": 3681048888979627981,
    "subreddit": "depression"
  },
  {
    "text": "I hate 'foggy brain syndrome' Does anyone else feel like their mind isn't as sharp as it used to be? Back when I was a kid, I was actually able to focus on things and had a pretty good memory. Now, it's like I'm on permanent autopilot. I rarely ever take note of my surroundings or have clear inner monologue. I'm always stuck in this half-awake state where I can't focus on multiple things at once and just kind of \"zone out\" so to speak. I also tend to forget things really quickly for some reason.\n\nIt makes me feel like some useless, brain-dead retard that can't even function normally or think basic thoughts. It's as if my cranium is rotting away or something. I'm stuck with permanent brain fog and there's nothing I can do about it. I take antidepressants and vitamin d pills, I drink lots of water, I eat healthy, but nothing works. \n\nI hate the fact that my brain will never work the same way again, all because of depression. It's destroying my life and I can't take it anymore.\n\nEdit: In case anyone is curious, I don't do drugs or drink alcohol, nor am I old. I'm just a depressed 22 year old dude.",
    "source": "Reddit",
    "timestamp": "2021-02-09T21:16:43",
    "user_id": -7957670676760937567,
    "subreddit": "depression"
  },
  {
    "text": "I don't want to die but if I was offered a chance to erase myself from existence, I would take it Apologies in advance for the ramble that follows and for any mistakes as this isn't my native language.\n\nNo matter how busy I make myself, it all seems pointless in the end. What the fuck am I working towards ? Doesn't seem like I have any purpose in life even though I'm 26 and most people my age are making their careers and starting to settle down.\n\nAnything I do is to distract myself from my thoughts but I end up at the same dark place at the end of every day. Honestly feel like instead of growing as a person, I deteriorated in the last few years.\n\nI have no motivation left except that I love my parents and them having to witness my death will destroy them. If only there was a way to erase myself from everyone's memories.",
    "source": "Reddit",
    "timestamp": "2020-08-15T06:34:18",
    "user_id": -8150653890580108127,
    "subreddit": "depression"
  },
  {
    "text": "Anhedonia is the worst part of depression You're alive, but you aren't living. You feel like doing something, anything, but nothing is appealing. Everything feels like a chore, and it's exhausting. \"Do things that you enjoy doing\" doesn't work, since everything feels like watching paint dry. Realising that you're slowly beginning to lose interest in the few things you enjoy doing and realising that there's nothing you can do about it is mentally torturing. It's like trying to catch smoke with your bare hands; it's hopeless. The only thing you look forwards to is death.",
    "source": "Reddit",
    "timestamp": "2020-11-30T23:06:26",
    "user_id": -2325800415815777815,
    "subreddit": "depression"
  },
  {
    "text": "Has anyone ever gotten so lonely and depressed to the point where all you wanted is merely a hug or a \"are you ok\" from someone? *Maybe a little bit of warmth? Maybe a hug people !?*\n\nEdit: Wow I didn't expect that many upvotes and comments. Thx yall for the virtual hugs and comfort <3 I feel better after seeing so many people on the same boat as me. THE BOAT IS GONNA SINK XD",
    "source": "Reddit",
    "timestamp": "2020-07-26T06:16:14",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "You ever feel bad for not checking up on somebody then you realise the phone goes both ways and they aren't checking up on me are they? ",
    "source": "Reddit",
    "timestamp": "2020-04-18T10:40:39",
    "user_id": -4795246738378847761,
    "subreddit": "depression"
  },
  {
    "text": "I fucking hate dreams that make you feel love and make you feel happy They just give you a taste of what you’ll never have and when your self-esteem is at an all time low it just makes you want to kill yourself even more",
    "source": "Reddit",
    "timestamp": "2020-07-12T11:00:15",
    "user_id": -8577258791533323706,
    "subreddit": "depression"
  },
  {
    "text": "Do you ever think, “Fuck, I just wanna go home,” but you’re already inside your “home”? A house (or apartment) is surely different from a home, and it seems I haven’t had a home for many, many years now despite always having a place to stay. I understand it is a gift to have shelter, and I realize it may be insensitive to someone who is struggling with homelessness; this is just my experience.",
    "source": "Reddit",
    "timestamp": "2020-10-03T00:03:43",
    "user_id": 2556569969050155904,
    "subreddit": "depression"
  },
  {
    "text": "When you realize that you have an incredibly easy life but you’re screwing It up for yourself My life is objectively very easy but my depression makes it all feel like a struggle",
    "source": "Reddit",
    "timestamp": "2019-09-26T05:06:33",
    "user_id": -4342407751141412549,
    "subreddit": "depression"
  },
  {
    "text": "Does anyone else stay up to 3AM every night wanting to die only to get up for school and start the cycle over again every day? I'm so tired and I hate everything.",
    "source": "Reddit",
    "timestamp": "2019-11-06T13:34:51",
    "user_id": 2192408130737630710,
    "subreddit": "depression"
  },
  {
    "text": "I wish I could say \"I was depressed\" the same way I say \"I was sick\" to explain my absence I'm so tired of making excuses. I am sick, just in my head.",
    "source": "Reddit",
    "timestamp": "2019-11-22T13:05:52",
    "user_id": -4338026964375106668,
    "subreddit": "depression"
  },
  {
    "text": "Life doesn't \"get better\" unless you take actions to MAKE it better. But depression itself can make it impossible to act Exercise/physical activity, eating healthy, spending time in nature, finding a hobby are all things that are supposed to \"be good for your mental health\"... but by definition, depression is a problem *precisely because* it inhibits your inability to function, much less do things that are good for you. Finding a therapist, trialling multiple therapists to see which one suits me best, or even starting on antidepressants and having to check in with a doctor/psychiatrist every few weeks, or having to change medications because one might fuck up my head even more, or not even work... all takes so much fucking effort that I can't bother to do any of it.\n\nI went to a counsellor at my university earlier this year, and they suggested things like group therapy for my anxiety and volunteering for causes because that can give people a sense of purpose in day to day life... and I just didn't know how to tell them, that is exactly the problem, *I have utterly no will to do any of that and that's why I'm sitting in your office right now and I don't know what anyone can possibly do about me being this way*.\n\nIf people with depression were able to so easily do things to help themselves, we wouldn't need to classify it as an 'illness' or 'disorder'. That's why it's so infuriating when we see how even 'professional' mental health advocacy organizations repeat the hackneyed slogans which I cannot understand how they are even still in mass circulation.\n\nIt's so irrational and frustrating that I'm physically able to take ten steps out of the house to just go on a goddamn walk, but I have absolutely no mental will to do anything but lie in bed. Only listening to music is the only action that can be done purely passively with no effort whatsoever, but then I just get sad and start spiralling from guilt. And I can't stop thinking about how irrational it is, even though I've experienced it for so many years. I'm constantly surprising myself from my own incompetence, as if I ever expected anything different.\n\nMore than hopelessness, I just feel confused as to what I'm supposed to do when I can't will myself to do anything. What even is this anymore?\n\n\nEdit: Thank you for all the comments. I didn’t expect to get any response. It’s hard to describe, but I feel very moved that there are people out there that I reached in a small way for a short moment of time.",
    "source": "Reddit",
    "timestamp": "2020-08-02T18:40:00",
    "user_id": 8248596055421102617,
    "subreddit": "depression"
  },
  {
    "text": "I went to university to get a degree instead i got depression and anxiety I have never been in this low mental state before\n\nEdit: i read every comment you all are so wholesome🤗!! !  you are the best people on earth ! this subreddit is full of amazing people who understand each other! \n\n2 Edit: thank you for gifts !!",
    "source": "Reddit",
    "timestamp": "2020-11-04T11:16:05",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "2 years since I dropped out of college due to anxiety and depression, I finally signed back up for classes yesterday. I finally did it guys!!!!! 2 years!! \n\nI was so depressed 2 years ago I started skipping classes, I failed every single class I was in. My GPA dropped to a 1.7. I lost my financial aid, which I couldn't go back the next semester without.\n\nI spent the last 2 years, becoming more and more depressed because I couldn't afford to go back and I ruined my life over depression. \n\nBut I finally did it!!!! (with the consistent encouragement of my boyfriend who told me hes going to keep on top of my ass and I'm not allowed to skip class) I still have a year and a half left for my associate's because of how much I failed but it's a start.\n\nEdit: I cant believe how many people replied to this!! Thank you all so much for encouraging me, to know I had 100+ people comment to tell me how proud they are makes me even more motivated to do well this semester. \n\nAlso to all the people who said this post gave them a little kick in the ass to go back, were all going to do amazing :)",
    "source": "Reddit",
    "timestamp": "2019-08-15T14:15:16",
    "user_id": 1773365532500732434,
    "subreddit": "depression"
  },
  {
    "text": "Being suicidal is like being at a terrible party Being suicidal is like being on a really terrible night out. I'm having a terrible time but my friends and family are all enjoying it so I stick around. They're the ones that invited me and said I'd have a good time. But as time goes on, the desire to leave just gets stronger and stronger so I try to distract myself by getting some more drinks to make it a bit more bearable but I still really just want to leave. But everyone is telling me that this is a great night out to be on and that I should just stay and try to enjoy myself. But I'm not enjoying myself. I'm just numbing my annoyance at not being allowed to leave with drugs and alcohol. I've got to the exit door a couple of times but I couldn't get any further than that. What's more annoying is that while I can get help to make the night out more manageable, I'm not allowed to just leave. I'm stuck here. It feels like this night out has just turned into a prison sentence.",
    "source": "Reddit",
    "timestamp": "2020-10-27T12:10:44",
    "user_id": 6244616839560723372,
    "subreddit": "depression"
  },
  {
    "text": "Does anyone else get really happy and motivated for a few hours to a few days, just to fall off the edge again? It feels like I'm on a rollercoaster with 80% super lows and 20% kinda highs..",
    "source": "Reddit",
    "timestamp": "2019-07-14T18:28:40",
    "user_id": 3965618681486280802,
    "subreddit": "depression"
  },
  {
    "text": "My therapist finally convinced me to start getting out of the house and this shit happens. I'm never going to get better why the fuck should I even try.",
    "source": "Reddit",
    "timestamp": "2020-03-16T22:09:44",
    "user_id": 8677721163332077053,
    "subreddit": "depression"
  },
  {
    "text": "After 1 suicide attempt, and one overdose, I GRADUATED!!!! I MADE IT. FUCK EVERYONE WHO PUT ME DOWN. FUCK THE BULLIES, FUCK THE CLIQUES, I DID IT. But more importantly, THANK YOU to everyone who kept me going. It brings me to tears thinking about how thankful I am to be here today because of my family, friends, and the wonderful people on this subreddit who helped me when I was down. I feel so immensely proud and happy right now because of my achievements. To all the people struggling through high school and college, there is light at the end of the tunnel. I LOVE YOU ALL!!!!\n\n\nEdit: wow thanks for all the awards, love, and support!",
    "source": "Reddit",
    "timestamp": "2019-05-26T19:51:53",
    "user_id": 842141859049956226,
    "subreddit": "depression"
  },
  {
    "text": "Alive, barely. I wrote a suicide note today. \n\nI listened to funeral music.\n\nI lined up all my pills.\n\nI cried. And cried more.\n\nI thought of my mom.\n\nI thought of my dad.\n\nI thought of Paulie.\n\nI thought of Ang.\n\nI thought of Kris.\n\nI thought of everyone.\n\nI thought of soldiers in war.\n\nI thought of terminal illness.\n\nI thought of my possible future..\n\nI remembered what I'd be losing.\n\nI felt a rage grow in me.\n\nI put away my pills.\n\nI listened to angry music.\n\nI didn't kill myself today.",
    "source": "Reddit",
    "timestamp": "2020-01-26T14:38:29",
    "user_id": -4273221524745839443,
    "subreddit": "depression"
  },
  {
    "text": "Too depressed to have a healthy relationship yet constantly wanting love and affection. I hate this.",
    "source": "Reddit",
    "timestamp": "2019-11-21T22:38:01",
    "user_id": 7157250357203857300,
    "subreddit": "depression"
  },
  {
    "text": "I think that the worst part of depression is that every day you just wait for the day to end cause that's all you have The point I realised that I think I collapsed in some way. That I only live from one day to another. That maybe my suicidal tendencies are just wanting to stop that cycle which slowly rots my mind.\n\nI feel like Im just a pile of dust on the edge of the table, waiting for someone to clean the table and stop my existance for good.\n\nIdk if any of it makes any sense. If anything in life actually makes sense.",
    "source": "Reddit",
    "timestamp": "2021-02-18T17:15:50",
    "user_id": 2428310187309590213,
    "subreddit": "depression"
  },
  {
    "text": "Don't you just want to sleep and sleep and sleep? It's the closest thing to dying. This life sucks.",
    "source": "Reddit",
    "timestamp": "2019-08-26T10:41:33",
    "user_id": 5500302661824197506,
    "subreddit": "depression"
  },
  {
    "text": "I miss myself I miss when I was happy and life wasn't pointless.",
    "source": "Reddit",
    "timestamp": "2019-06-17T22:56:35",
    "user_id": -8243427448211821644,
    "subreddit": "depression"
  },
  {
    "text": "Depression is one of the few diseases that can end your life without killing you Like, I’m still alive, but I can’t experience my life anymore. I’m basically a walking dead zombie.",
    "source": "Reddit",
    "timestamp": "2020-08-11T01:25:07",
    "user_id": -1201665238643960948,
    "subreddit": "depression"
  },
  {
    "text": "The worst part of depression is that it's stolen my personality My actual personality is over the top, fun(in my opinion), confident, and kind. But the depression teams up with social anxiety so that I just don't have enough enough energy to act like who I truly am. I turn into this very flat, monotone, boring, quiet person who I would never want to hang out with or date.\n\nIt's the main reason I avoid social interaction now - it feels humiliating because I feel like I'm perceived as this pathetic, pitiable, ignorable person.\n\n When I'm feeling better and have a little more energy I can act like myself but usually I'm just this shell. It's horrible, like watching the progression of ALS in a loved one; they just slowly fade away until there's nothing left of who they used to be. At least with physical illness or bipolar or whatever you have yourself, that fundamental spark of who you truly are, and you're able to show that and share that with others. I don't even have that privilege. \n\nSorry if this comes off as arrogant or insensitive, this is just how I feel.\n\nedit: Guys, thanks so much for all the responses. I appreciate all of you. I didn't know so many people felt the same way, and I'm glad if I was able to help give voice to your struggles. I've had depression my whole life so I've had a lot of time to think about these things. I think it helps to be able to really narrow down what you're feeling. I wish you all luck in getting better.",
    "source": "Reddit",
    "timestamp": "2019-04-03T04:45:15",
    "user_id": 2049506344231082314,
    "subreddit": "depression"
  },
  {
    "text": "Life feels like staring at the fridge when nothing looks good to eat You know the feeling - you're hungry and open the friedge but everything in there looks disgusting. So you either give up and don't eat or force down something that is completely unsatisfying. That is every part of my life right now.\n\nI don't know how else to explain it. I have energy now (with my meds) and an urge to be doing something, but nothing seems appealing. \n\nWhen I do things, I don't feel good about it or pleasure. But if I sit around doing nothing, I feel the urge to be doing something.\n\nI don't know what to do or how to explain it.\n\nEDIT: Holy crap. Thank you everyone for the likes and awards and comments. It makes me feel connected and a little less alone. I will try to reply to all the comments.",
    "source": "Reddit",
    "timestamp": "2020-09-23T21:42:29",
    "user_id": 1891552697448187523,
    "subreddit": "depression"
  },
  {
    "text": "I can overhear my mother on the phone laughing and joking about my depression to her friend Saying things like “she’s so emotional hahaha” and telling her friend everything I just said that was making me upset.\n\nEverything about me is just a joke to her, just a topic of discussion for her to gawk over.\n\nI don’t even know why I’m crying, what else should I expect from someone who hasn’t ever given me any kind of legitimate emotion support.",
    "source": "Reddit",
    "timestamp": "2019-12-22T14:08:21",
    "user_id": -3323920195211323857,
    "subreddit": "depression"
  },
  {
    "text": "I hate being depressed. The moment something goes wrong or someone hurts you, you are contemplating suicide. I am emotionally and physically drained. Tired of this thing called life. I hate people😔\n\nEdit: I just want to say thank you for your kind words. This has really shon me that I am not alone",
    "source": "Reddit",
    "timestamp": "2021-08-11T01:49:08",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "I sleep all day because it’s the closest thing I can get to not existing I’m too cowardly and afraid of pain to commit suicide but I just don’t want to exist.",
    "source": "Reddit",
    "timestamp": "2020-07-08T12:34:01",
    "user_id": -4342407751141412549,
    "subreddit": "depression"
  },
  {
    "text": "Ive decided to get admitted to a hospital instead of just killing myself Hi, im obviously depressed and have almost killed myself countless times. Ive been living in a hotel for 2 weeks planning to kill myself here, away from anyone i know. The thing that stops me is the thought of hurting my friends. I went to a hospital for help once but the environment/doctors just made me feel even more depressed and trapped. I have been really scared to go to the hospital since last time it just put me in a worse place. Now i know that i have to go because otherwise im certain ill just kill myself. Im writing this so that my decision can become relatively real and so i am more likely to hold myself to it. Thank you for reading and i sincerely hope that everyone in this subreddit overcomes their depression, no matter how impossible or pointless it may seem. Good luck to everyone",
    "source": "Reddit",
    "timestamp": "2020-09-13T22:48:37",
    "user_id": 8588720314228271653,
    "subreddit": "depression"
  },
  {
    "text": "Depression = Losing intelligence The worst part about depression for me, even worse than suicidal thoughts or constant pain, is the huge toll it has on my mental faculties. \n\nI think slower. I need longer for decision making and understanding pretty basic things in conversations. I can't plan anything because it is too much mental effort. I read a sentence in a book and don't register the information it's supposed to convey.\n\nI can't think as deeply. As a teenager, I was able to hold my train of thought and look at a problem for a long time and find an intricate solution. That's gone. My ability to think any deeper than surface level is lost. \n\nI'm not improving my programming skills, even though I do it professionally on a daily basis. I just don't seem to have the mental capacity for improvement. \n\nIt has been like that for years, even worsening, I'm worried that I'll just stay \"depression stupid\" forever. It's also completely ruining my future, because I can't make any sound decisions.\n\nEDIT: This blew up over night, I'm thankful for the lively discussion in the comments, thanks for the awards. May you all find a way to get rid of this. Lots of love.",
    "source": "Reddit",
    "timestamp": "2020-08-24T20:37:27",
    "user_id": -37473718789065423,
    "subreddit": "depression"
  },
  {
    "text": "Imagine if the cure to a broken leg was to run a marathon with it. That's what getting help for depression looks like to me. I'm discouraged today! :D \n\nEdit: This is a bit overwhelming. But reading all your comments was lovely. I hope every single one of you struggling will find the light one day. I guess we can run this marathon together if that's what it should come for. You lean on me so your broken leg doesn't hurt as much, and I'll lean on the second person, etc. Have a wonderful day ❤️",
    "source": "Reddit",
    "timestamp": "2017-12-06T16:09:05",
    "user_id": -8388679296262566518,
    "subreddit": "depression"
  },
  {
    "text": "I (24 f) got dressed and did a bit of my makeup to meet up with a friend at a coffee shop. I’m in the middle of a depressive episode and dealing with some great difficulties in my personal life. She didn’t show up. This was my attempt to “reach out”. Update:\n\nSorry in advance, I’m on mobile and this is long. \nI really wasn’t expecting this amount of support and kindness from so many people. Thank you all for the uplifting words and thank you for the rewards! \n\nI’d like to first address any concerns about meeting up during the pandemic. My friend and I made plans to meet up at a coffee shop, buy a quick cup of coffee, and then immediately head to a park nearby in separate cars. The coffee shop is on small a military base so that cuts the amount of people that were in there down by a lot. I went ahead and grabbed coffee and then waited on a bench outside of the shop for around 30 minutes or so before leaving. I stayed 6 feet away from others and wore a mask the entire time. I played it safe and went by the rules.\n\nNext I’d like to say thank you to those who have helped me realize how big of an accomplishment it was for me to get to the coffee shop. It really did take a lot of effort and I appreciate the reminder that it took strength I didn’t know I had. \n\nI also want to thank those who have expressed empathy towards my friend. She is going through a rough time and has been since long before the pandemic started. I wasn’t angry at her because I understand that she’s struggling too. I was just really sad and disappointed because I’ve only seen her once since last year. It was more of a bummer than anything and I just needed somewhere to get it off of my chest so I came to Reddit. Kind people of Reddit, you did not disappoint! \n\nI’m going to continue being her friend because she is very dear to me. Knowing the kind of person she is, she probably truly forgot, there was a potential miscommunication, or she may have had something come up that she couldn’t get out of. It would have been nice to get a bit of a heads up or an explanation, but I haven’t dwelled on it too much. She’ll reach out when she’s ready to. If not, then I understand that too. \n\nI’ve been in therapy and medication since 2018 and recently sent a cease &amp; desist letter and went no contact with my mother. As a result of that I haven’t heard from my Dad since it happened. I also live states away from my childhood friends and what’s left of the family that supports me (not many people). I’m better off being out of that toxic environment but it’s still a grief process losing people that are still alive. I have also been grieving what could have been if I only had healthy and supportive parents. \n\nI’m also struggling with my marriage. I’m a military spouse and it’s hard being so far away from the little support I have states away (my sisters). I won’t go into detail here about my rocky marriage but it’s been traumatic and hard. I haven’t gotten much support other than therapy and the support my younger sisters have been capable of giving. I’m in the process of filling out divorce papers and working with an attorneys office to explore my options. \n\nI also had surgery at the end of October to repair a hernia. It wasn’t too big of a deal, and my sisters came from out of town to visit during my recovery, but it did knock me down a bit emotionally because I was restricted from carrying anything over 20 pounds. That meant I couldn’t hold my toddler who is 30 pounds and that was really hard on both of us. \n\nIt just would’ve been nice to be able to have hung out and talked to the one friend I have here about everything going on. It honestly would’ve been nice to talk about things that have nothing to do with all of the crap that has  gone on this year too. \n\nIt’s okay though! Life will carry on and there will be better days. I still got my coffee, got outside, then came home and hung out with my son and put up Christmas decorations. \nI also got a ton of fantastic advise and support from you lovely folks. Thank you again!\n\nTL;DR Thank you for the support and kind words! I’m not mad at my friend, just sad we couldn’t meet up. I followed social distancing rules when going out. 2020 has sucked but personally, so has the past decade or so.",
    "source": "Reddit",
    "timestamp": "2020-11-22T21:19:02",
    "user_id": 627133253009756615,
    "subreddit": "depression"
  },
  {
    "text": "Just because I laughed at a joke doesn’t mean I’m suddenly cured of my depression My parents don’t seem to grasp this concept, just needed to vent",
    "source": "Reddit",
    "timestamp": "2021-04-11T15:58:03",
    "user_id": 1217148612211936355,
    "subreddit": "depression"
  },
  {
    "text": "We only wish depression was being \"sad\". But depression is much more than that. \r\n\nIt’s the excuses you have to make when you can’t make that meeting. \r\n\nIt’s the friends and family you’ve lost because you can’t explain why. \r\n\nIt’s the opportunities that land in everyone else’s lap, that they get to grasp with both hands, while yours slip out of your grasp. \r\n\nIt’s the exhaustion that binds your body to your bed. \r\n\nIt’s the hatred and resentment you feel towards yourself, towards the world for being the way it is. \r\n\nIt’s your proven truth that everything and everyone gets better, except for you. \r\n\nIt’s the demon that dragged you down and trapped you in the hellish prison that is your own mind. \n\r\nIt’s the ball and chain locked around your neck, choking the life out of you as you trudge through your marathon, while everyone else gets to charge on ahead, unimpeded. \r\n\nIt’s the wall that blocked you off from life. \n\nIt's the leech that sucked out everything positive about your life and clouds your memories. \n\nIt’s not just being “sad”. And we can only wish it was. \n\n*Edited to add: Thank you all for the kind words and awards. I really didn't expect this to blow up as much as it did. I wrote this in an attempt to put my experience with depression into words, and to serve as a reminder of what it feels like, for the times when normal people try to tell me my depression isn't real or otherwise downplay it.*",
    "source": "Reddit",
    "timestamp": "2019-05-30T07:11:06",
    "user_id": -8432242254499822219,
    "subreddit": "depression"
  },
  {
    "text": "It's hard to take care of yourself, when you don't care about yourself. Title says it all. Trying to get your life together just feels like working at a job I hate.",
    "source": "Reddit",
    "timestamp": "2020-08-06T04:26:15",
    "user_id": -4921571533962624671,
    "subreddit": "depression"
  },
  {
    "text": "I finally know why I stay up so late it’s the calmness around me, silence, no responsibilities, no work, just me and quiet room full of nothing. \n\nI just want this moment to last for as long as possible so I refuse going to sleep. \n\nthinking about waking up and going through another day just makes me sick.",
    "source": "Reddit",
    "timestamp": "2022-05-08T23:10:35",
    "user_id": 6637072907751369811,
    "subreddit": "depression"
  },
  {
    "text": "Ever wake up in the morning and immediately fill with dread that you have to go through the agony of another day? Going to sleep is my favorite thing bc I can shut off everything else.\n\nEdited to add: I am so sorry you’re all relating to this. We can all get through these moments together. The good news is that we never have to live a day twice. Once today is over, that’s it. If we survive today we can survive tomorrow 💕",
    "source": "Reddit",
    "timestamp": "2020-08-18T13:01:30",
    "user_id": -219064246717165783,
    "subreddit": "depression"
  },
  {
    "text": "I'm black, I'm scared, tired and I'm at the end of my rope with life. Jesus, how do I even start. As you could read by the title, I'm a black man. I've always been in the fight. Grew up with racism in all its forms in my country, which, ironically, usually denies there ever being racism in any way.\n\nThe kind of shit I've heard through my entire life has molded me into someone with no self-esteem, sense of self-worth, voice and made into introvert. Because of the mentality of \"you need to work twice as hard as everyone out there\", I always saw the future as bleak, tiresome and as more struggle. This never really changed. It just got worse with time, with college and the awful reality that came afterwards.\n\nI've been depressed for most of my life, with my initial diagnosis at age 9. I still have it, with severe anxiety. My first suicidal thoughts came at age 8, and then and there I already hated myself for everything. For not being enough, for not being what the world wanted, for failing myself at being the best, for never getting anything good out of my own life, for never letting myself rest or be human.\n\nAnd with all the recent events, like the absurd police brutality worldwide, the rise of authoritarianism in my country, with being worked to the bone and around the clock due to the pandemic, with my country quickly moving up to be the worst afflicted by covid-19 and my mom and me being in danger during these times by living in a neighbourhood near a place where a white supremacist parade happened, which also happens to be a place where a lot of people are simply disrespecting quarantine... All of this shit, is just wearing me down really badly.\n\nI wake up exhausted. I can't deal with anything without having a serious bout of anxiety or anger outbursts, followed by fullscale breakdowns. I'm feeling guilty by worrying my friends and my mom. I feel guilty by feeling tired, by feeling afraid. I feel guilty by not feeling brave enough to go out on the streets for my people and taking action. I feel guilty for existing. I'm so fucking exhausted and I don't know what to do. I just want it all to end, I just wanna go somewhere else. I can't handle anything anymore.\n\nEdit: all of this support... I'm very, very thankful for it. I think I've never felt this supported in my whole life. All of your words have touched me deeply. I'm so glad you helped me. I feel more hopeful, more energized from talking to you all. Thank you. Thank you all, from the bottom of my heart. You've all stopped me from doing something terrible today. Thank you.\n\nEdit 2: wow, I was not expecting this kind of response from so many people. I'm trying to respond to everyone, but I think I can't. I'd like to thank you all once more for all your words. I'm very glad that I vented about all these feelings here with you all. I feel so much support from you and I feel like my feelings are valid and worth feeling. It may seem a bit dramatic, but I'm legitimately walking out of this with a different outlook on life. I never expected to see so many people I don't know just rush in to support me when I'm in my absolute worst. So thank you, once more for being here for me. I mean it. I love you all",
    "source": "Reddit",
    "timestamp": "2020-06-05T13:24:45",
    "user_id": 9093715076858238048,
    "subreddit": "depression"
  },
  {
    "text": "Staying alive just so you won't make anyone sad seems exhausting. I always say that. 'I'd never kill myself because i wouldn't want to make my family sad.' But what if I'm 50 and still feeling this way? Suffering through decades feeling like shit, just so i won't make anyone sad seems so f.ckin exhausting. I'm sorry if I'm seeming selfish.",
    "source": "Reddit",
    "timestamp": "2020-11-02T19:46:52",
    "user_id": 4892930029752777002,
    "subreddit": "depression"
  },
  {
    "text": "Does anyone else find it increasingly hard to pretend to be a normal functioning human being? My only social interaction is at work but it's getting harder to pretend I'm a normal functioning human being. Haha sports, family, friends, hobbies, ambition, future, yeah I totally love them haha I am a normal human being that has things that normal beings enjoy too haha I am normal too haha",
    "source": "Reddit",
    "timestamp": "2020-03-10T23:51:30",
    "user_id": -7398614661433466370,
    "subreddit": "depression"
  },
  {
    "text": "It’s not that I want to kill myself. But if I die I wouldn’t be upset. I don’t think i could ever kill myself but that doesn’t mean I don’t want to die. It’d just be so much easier than disappointing everyone I love if something just happened to me and I died. I know it isn’t right to think like this but I can’t stop.\n\n\nEdit: this blew up, it’s kinda bittersweet knowing so many others feel the same.\n\nEdit 2: thank you all so much for the words of encouragement. I’m home now and would love to reply to all of them but I have to do homework. Things will get better for all of us if there’s this much support in the world.",
    "source": "Reddit",
    "timestamp": "2019-08-28T13:46:06",
    "user_id": -6934566838800084955,
    "subreddit": "depression"
  },
  {
    "text": "Has anyone else went to see a therapist to get help from their severe depression, but once you get there your mind is so hazy and forgetful that it makes it extremely difficult to explain your experience? I found that a lot of times in the past I would be rushed out the office with crappy advice that I was already “trying” to do and then I panic and try to desperately get everything out by the end of the session. It’s hard to open up about it when I’m having an episode because the symptoms of pure confusion, difficulty thinking and focusing, MEMORY LOSS and just plain blankness of mind makes everything so frustrating... \n\n\n\n*For not from depression, sorry",
    "source": "Reddit",
    "timestamp": "2019-08-01T11:02:07",
    "user_id": 1705158522999643051,
    "subreddit": "depression"
  },
  {
    "text": "When I’m sitting on my ass doing nothing, I feel useless and depressed. When I’m actually doing something, i think about how I’d rather be just relaxing at home Just a loop of unhappiness, really hope I can fix it soon.  I wanna know what the fuck happened to my motivation and care for life.",
    "source": "Reddit",
    "timestamp": "2019-04-11T19:07:22",
    "user_id": -3136134581673268274,
    "subreddit": "depression"
  },
  {
    "text": "I almost killed myself today I just broke down. That just overwhelming feeling of worthlessness and self hate just maxed out. I sat in my dark living room sobbing and trying to decide if I should write anything. Before I could do anything my cat came and jumped on me. He pressed his face to mine and I just snapped back. I’m trying so hard to get better. I’m glad my cat jumped on me. That sweet little guy saved me.\n\nEdit: I want to thank everyone for their kind words. I didn’t expect to receive so much kindness. For those wondering, I am currently seeing a therapist and psychiatrist for mental health and medication management.\n\nTo the few people who said hurtful things. My story may be “cliche and boring” but it’s still my fucking life. It’s my experience, I can’t change it to make it more exciting or interesting for you. It wouldn’t be real then. To those who told me to try again and that I’m a failure. You don’t have to tell me that. I know but I’ve never been more happy to fail at something in my life.",
    "source": "Reddit",
    "timestamp": "2019-05-11T12:47:55",
    "user_id": -1279200485442661016,
    "subreddit": "depression"
  },
  {
    "text": "I feel like I’m addicted to depression. Whenever I feel sad I don’t try to cheer up I try to make myself sadder because I like it more. I feel addicted to isolating myself from others and there’s a small part of me that enjoys feeling depressed and isolated. Depression feels strangely comforting at times. Does anyone else have this issue?",
    "source": "Reddit",
    "timestamp": "2020-02-09T19:23:16",
    "user_id": 4983568212600925236,
    "subreddit": "depression"
  },
  {
    "text": "the worst thing about depression,is seeing everyone around you progress in their life and you are stuck in the same place its like when you are playing videogame and you get stuck on some part of mission,while others are having fun,you are having the worst time in ur entire life",
    "source": "Reddit",
    "timestamp": "2020-02-18T21:48:03",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "Do you ever feel that the deeper in depression you are, the dumber you become? Today I was feeling extremely low. I don't know but my I feel like my ability to process information and write has been decreased. I'm just so angry and irritable. I hate this feeling",
    "source": "Reddit",
    "timestamp": "2019-05-07T16:48:42",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "Nostalgia Is Not As Pleasant When You're Depressed For most people nostalgia is generally accepted as being a nice feeling, a pleasant memory. But for me it just reminds of a more innocent, happier time when I was child. I thought my future was good and all I cared about was playing with friends and climbing trees. How things have changed\n\nEdit: I genuinely didn't expect so many kind comments even on a sub like this. I feel better and I have you all to thank for that.",
    "source": "Reddit",
    "timestamp": "2021-03-14T16:44:46",
    "user_id": -8638616045627044893,
    "subreddit": "depression"
  },
  {
    "text": "A Depressed persons vocabulary \"I'm fine\" \"Im okay\" \"nah I'm just tired\" \"it's not a big deal\". what do you guys say when someone gets mad at you for being sad? or when your being moody because your sad?",
    "source": "Reddit",
    "timestamp": "2019-04-07T22:32:24",
    "user_id": -3642978613859208850,
    "subreddit": "depression"
  },
  {
    "text": "Does anybody else ever stay up late so they can avoid tomorrow? ",
    "source": "Reddit",
    "timestamp": "2017-09-11T03:44:28",
    "user_id": 372163631060371133,
    "subreddit": "depression"
  },
  {
    "text": "I don't wanna kill myself, I just don't wanna wake up anymore. Idk if that makes sense. But I don't want to kill myself, I really don't. I want to be killed. I want to be shot or to not wake up. I don't want to make the choice to kill myself because my friends and family will feel responsible but I want to die.",
    "source": "Reddit",
    "timestamp": "2020-06-19T06:17:46",
    "user_id": -1173642091929449835,
    "subreddit": "depression"
  },
  {
    "text": "When I don’t have a job, I want a job. When I have a job, I don’t want a job. When it’s hot, I want it to be cold. When it’s Fucking cold, I want it to be hot. When I’m myself I want to be with people, when I’m with people I want to be by myself Do you guys see what I’m saying here. I’m always constantly completely bullshitting myself 24/7. I always pretend that there are a few certain things that would make me feel a little better then I get them and I want the opposite. Complete self destruction and all ",
    "source": "Reddit",
    "timestamp": "2018-07-05T15:34:23",
    "user_id": 1804890886849782945,
    "subreddit": "depression"
  },
  {
    "text": "It sucks how mental health is never a valid excuse in college *CW* \n\nanywhere, really, work/jobs included. I can't keep track of my lies. My \"headaches\" and \"migraines\" and \"feeling sick\" are all lies. I can't keep track of them. I wish instead of saying \"I stayed home because of my headache\" I could say the truth \"I have no motivation or energy. I want to kill myself. I hate myself so much and I want to die. I can't even drink water or eat healthy. I can't even do my work. I want to kill myself\".",
    "source": "Reddit",
    "timestamp": "2020-09-09T13:53:52",
    "user_id": -6393295938911558675,
    "subreddit": "depression"
  },
  {
    "text": "An unexpected side effect of depression: the decline of cognitive capabilities This has been really scaring me lately. Since becoming depressed I've noticed more and more;\n\n- an inability to maintain thoughtful conversations with people\n\n- severely reduced attention span\n\n- short term memory loss\n\n- severely reduced motivation\n\nI think it largely has to do with my partaking in escapism, as I spend much more time browsing reddit/youtube and getting high since when I actually try to focus on work I usually end up crying. The result seems to be a feeling like I've been living in a haze, like I'm never really fully aware of what's going on, I'm just passively going through the motions of life. \n\nGetting out of this rut is going to be so much harder than I thought. I literally feel stupider now that I've been depressed for months. I can barely even talk to people in my classes now, they seem so competent and on top of things while I'm just an embarrassment who can barely form a coherent sentence.",
    "source": "Reddit",
    "timestamp": "2019-11-16T05:08:40",
    "user_id": -568387098263184060,
    "subreddit": "depression"
  },
  {
    "text": "Too depressed to be productive, and not depressed enough to kill myself I lowkey wish I can be pushed over the edge so I'll have the courage to end it all (as horrible as that sounds)",
    "source": "Reddit",
    "timestamp": "2019-06-11T13:08:13",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "I hope being dead is like sleeping,because im tired,i really am,i just want to sleep forever and never wake up again ",
    "source": "Reddit",
    "timestamp": "2019-09-29T19:58:58",
    "user_id": 4406891053349873811,
    "subreddit": "depression"
  },
  {
    "text": "I don’t live for myself anymore, I only live so my mom doesn’t have to go through the pain of me committing suicide I wonder how much longer I can continue like this",
    "source": "Reddit",
    "timestamp": "2020-02-17T02:32:55",
    "user_id": 8959043790118288855,
    "subreddit": "depression"
  },
  {
    "text": "I feel like I'm getting stupider, less talented, clumsier, and that soon I will be completely retarded. As the title says. I feel like I'm getting worse and worse at everything. I feel like I'm getting weaker, much much dumber (I used to know a shit ton of trivia, a lot of history and be really good at helping people out. Now I've forgotten most things unless I read up on it daily, I've been relying more and more on canned responses when talking to people and I've become completely socially unaware). Things that used to be easy are now difficult, I constantly make typos and I can't even concentrate on things I like, much less things I dislike.\n\nAnyone else feel like that?",
    "source": "Reddit",
    "timestamp": "2018-02-26T14:50:59",
    "user_id": 4318952748354022136,
    "subreddit": "depression"
  },
  {
    "text": "Does anyone else start sobbing when they think of how much they missed out on because of their depression? I feel like my depression took my entire teen years from me. I spent all my free time in high school crying and self harming at home while everyone else had friends and hobbies and went to parties. Then I did the same thing in college. I didn’t even move out from my parents house because I was too anxious to stay in a dorm. My ex used to tell me about how much fun they had in high school and how they were in a bunch of clubs and how they had the most fun in college staying in dorms with all their friends and doing fun, dumb stuff. It always destroys me to think about how I missed out on all of that because of something I couldn’t control. Now I’m 21 and just graduated college and I’m lost. I have no friends, no partner, no job, me and my family are on rough terms and I just got diagnosed with anorexia. It is just crushing me and idk what to do anymore. And I’m afraid to tell anyone because I don’t want to be sent back to a psych ward since I have no money to pay for it again. I’m just so broken right now. Can anyone relate to this crippling regret of missing out on what were supposed to be the best years of your life?",
    "source": "Reddit",
    "timestamp": "2021-05-09T21:44:02",
    "user_id": -7896070635173377043,
    "subreddit": "depression"
  },
  {
    "text": "Self care is too hard when you're depressed brushing hair, taking a bath, brushing teeth and putting on something nice is too damn hard with depression.",
    "source": "Reddit",
    "timestamp": "2020-10-04T14:12:53",
    "user_id": -7692695145624095668,
    "subreddit": "depression"
  },
  {
    "text": "Anyone else have issues showering/brushing teeth/etc to the point where it’s now a big issue? I can’t stop crying because I think I may have receding gums. I just lay in bed all day and cry, and the only reason I haven’t killed myself yet is because of my cat- who can’t even live with me anymore because of my landlord. So I send my dad money to feed him.\nEverything is shit. I never brushed my teeth consistently for years and now it’s fucking me. I’m so ashamed my face is disgusting. My face I don’t have the energy to wash and my teeth are getting yellow because I never have the energy to brush\n\nEDIT: thank you so much for all the beautiful replies <3 I slept for a while and I made sure to read everyone’s comments before brushing my teeth and washing my face this morning- baby steps<3 I’m so glad I found this r/.",
    "source": "Reddit",
    "timestamp": "2020-09-13T07:19:48",
    "user_id": 6953238438444290142,
    "subreddit": "depression"
  },
  {
    "text": "It’s crazy how fast I can go from “maybe I’m not depressed anymore!” to “I’m gonna take a nap and hope I don’t wake up!” I dunno, I’ll always think it’s getting better and then nope, hits like a damn truck, knocks me to the ground, and runs over me. \n\nIt always gets better for a bit, or I start to look forward to things, but clearly there’s no point to hoping if it all crashes and crumbles. If you don’t look forward to anything, you can’t be let down.",
    "source": "Reddit",
    "timestamp": "2021-11-09T15:33:32",
    "user_id": 879928240494829947,
    "subreddit": "depression"
  },
  {
    "text": "Today I woke up and didn’t want to die. After bordering on suicidal yesterday, I was surprised to find I had the motivation to get out of bed when I woke up this morning. The first thing I did was make my bed, and that’s a victory in my book. \n\nI love you all.\n\nEdit: Thank you for the Silver, and for the heartwarming comments. It means a lot!\n\nEdit 2: This has me all kinds of emotional. I’ve never had so much faith in the kindness of strangers.",
    "source": "Reddit",
    "timestamp": "2019-05-14T12:21:51",
    "user_id": -6020631548021130348,
    "subreddit": "depression"
  },
  {
    "text": "Fun fact: when I was younger many people told me I was a gifted child of above average intelligence. WELL I SURE SHOWED THEM, DIDN'T I?\n\nI'm a massive fuckup. I forget things the minute after I am told them. There's just a massive pile of fuzzy static in my head. My grammar has devolved into caveman-speak.\n\nI dunno if I blame my mental health or if I'm just stupid.",
    "source": "Reddit",
    "timestamp": "2019-06-08T21:00:27",
    "user_id": 4318952748354022136,
    "subreddit": "depression"
  },
  {
    "text": "I fantasize about a social life in my head I have full conversations with friends I don't have, about stories I haven't lived. I imagine how they'd respond and laugh at my jokes.\n\nI don't have any real friends, I spend my life alone because I have no real confidence in myself. I feel my youth wasting away and I hate who I am. I am unemployed so I couldn't have moved out from home.\n\nI imagine myself as a successful athlete (I know it's stupid) and I imagine how I'd interact with people and the questions they'd ask.\n\nIt's disappointing to come back to my real life and realize what I am. I've done nothing with my life for the past 8 years. And nothing is moving forward. I compare myself to other men my age, and I am a failure in every aspect. I am no better today than I was 5 years ago.\n\nI wish I could escape into my fantasies",
    "source": "Reddit",
    "timestamp": "2020-09-20T05:55:01",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "Nobody warns you that depression makes you an awful person to be around I didn’t even realise it myself until I took 2 tabs of acid and could look in at my life from an outside perspective, I’m awful to be around. I suck the energy out of every situation, I’m no fun, I’m never in the mood for laughing because I just constantly feel like crying. I’m like a black hole that sucks all the fun away and everyone on the outside just sees someone who’s constantly in a bad mood, there goes any chance of potential new friends approaching me. I wondered why people leave you during depression but I got it after that, I wouldn’t want to be around me either.",
    "source": "Reddit",
    "timestamp": "2021-10-23T00:20:05",
    "user_id": -9097657219864617120,
    "subreddit": "depression"
  },
  {
    "text": "Fuck u if u discriminate against people with trauma and mental illness You know how many people reject me and judge me for my mental illness/trauma? Guys will fucking play me, act all into me at first, and then flip the script and be like “oh srry this ain’t gonna work out, u don’t rlly love me ur just miserable haha bye” (they don’t say that literally but im trying to summarize lol) LIKE WTF?! You knew about my trauma and mental illness from day one! Why even entertain the idea of wanting me if you were just gonna reject me for things outside of my control anyways! Do you know how devastating and invalidating that is? That’s like saying someone with a disability can’t love someone because they’re not “normal”. Tbh I think the only reason guys do this is because they see girls like me as easy targets. Since I’m mental and I’ve been abused my entire life they think they can just walk all over me, and are surprised when I stand up for myself and don’t allow them to do that. Well, screw you and fuck off🖕🏽",
    "source": "Reddit",
    "timestamp": "2020-05-31T05:47:46",
    "user_id": -2526614706653976729,
    "subreddit": "depression"
  },
  {
    "text": "Anyone else barely hanging on to life with no motivation whatsoever? Too much of a coward to kill myself, but at the same time have no reason to live. I just need to know that I’m not alone who feels like this in this hour.",
    "source": "Reddit",
    "timestamp": "2019-10-22T10:19:57",
    "user_id": 4258180581268195711,
    "subreddit": "depression"
  },
  {
    "text": "Anger as a symptom of depression need to be recognized more Depression isn’t just being depressed all the time. Anger and feeling numb is also a big part of it. Before I was diagnosed, I was a lot to handle. I would get angry for no reason and destroyed my things as an ineffective coping mechanism. I even went as far as assaulting my mom once but luckily, I have a mother who was nice enough to not press charges and encouraged me to go into therapy. I now know better ways to handle my anger. Of course most angry people arent depressed (some people are just miserable) but depressed people are often angry. Also I’m not excusing my past actions I just did what I did and I can’t take it back",
    "source": "Reddit",
    "timestamp": "2021-03-04T12:22:56",
    "user_id": 1988521659854257903,
    "subreddit": "depression"
  },
  {
    "text": "Anybody feel like you died long ago, and you're just a zombified shell? I just go through the routine every day, and kinda let everything just pass by. I don't really have much of an emotional response to anything, and my personality feels like a mush of stuff. Like, whenever things go wrong, people say they want to die, and while, yeah, I don't like what happened, I just feel kinda... neutral.",
    "source": "Reddit",
    "timestamp": "2019-09-12T15:22:17",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "Is anyone else hating the fact that they’re wasting time of their life as you’re witnessing it all go in the drain because of their stupid mental illness holding you down? It’s so stressful. There’s so many things I want to do but I just can’t at the moment and it sucks. Theoretically, I could be physically paralyzed for months and it would be just the same as if I wasn’t paralyzed and living my regular depressed life. Watching your life go by without any motives and meaning as you have no one there beside you because you’ve kicked everyone out of your life is one of the worst feelings for me.",
    "source": "Reddit",
    "timestamp": "2019-06-30T05:35:29",
    "user_id": "anonymous",
    "subreddit": "depression"
  },
  {
    "text": "Do you ever get so empty you’re excited when you finally start crying because at least you’re feeling an emotion? I’ve felt empty for days and just now cried a little. Even though I’m miserable I was almost happy. It’s worse to feel like you’re dead than being sad.",
    "source": "Reddit",
    "timestamp": "2019-05-05T03:32:56",
    "user_id": -7172209759372697089,
    "subreddit": "depression"
  },
  {
    "text": "I wasn't built for this life! Every time I think about a job or career I get the urge to cry! I hate working, I do believe I may be lazy but, I also hate the idea of wasting my life on something I'm not passionate in. I have no passions for existing, I'm just here because I don't want to hurt my family. They'd be devastated if I committed suicide. I try to work and it's getting to the point where I'll last a day or two then I just stop going. They say \"you not supposed to like your job or career but, money money money\". Nobody asked to be a wage slave to maintain a living! I don't know what to do I'm 25 with no goals, two semesters of college that I got a 1.5 gpa in. I kept having panic attacks especially during exams. I wasn't built for this life!",
    "source": "Reddit",
    "timestamp": "2021-06-05T17:36:57",
    "user_id": 4386233471290057331,
    "subreddit": "depression"
  },
  {
    "text": "Despite the anxiety, despite the depression, despite all my self criticism and imperfections - I was a beautiful bride this Saturday! ",
    "source": "Reddit",
    "timestamp": "2018-07-16T16:51:58",
    "user_id": -7000537848742857478,
    "subreddit": "Anxiety"
  },
  {
    "text": "Today I promised myself bacon and eggs if I could get myself to a coffee meet up. I was too anxious to attend last week. Guess who got bacon and eggs?!! Feeling so proud of myself for going. ",
    "source": "Reddit",
    "timestamp": "2019-03-15T01:55:17",
    "user_id": -4872580453015430955,
    "subreddit": "Anxiety"
  },
  {
    "text": "Professor here, if you have missed class, please come back. We aren’t mad at you. Hello, I’ve read a lot of posts recently about folks missing classes and feeling too anxious to come back. Don’t worry. We would much rather you come back to our classes than continue to miss. We teach because we care about you individually. We care about what’s going on in your lives. I know it’s easy to see professors as these omnipresent overlords but know that we are human and we have definitely been in your position before. Please feel better and know that you are always welcome back into class. Just shoot us an email and let us know what’s up so we can help you make up the work you missed.\n",
    "source": "Reddit",
    "timestamp": "2019-02-20T06:39:13",
    "user_id": 5605448885578103426,
    "subreddit": "Anxiety"
  },
  {
    "text": "Message from your future self ",
    "source": "Reddit",
    "timestamp": "2019-03-19T17:40:14",
    "user_id": -7422807916688626990,
    "subreddit": "Anxiety"
  },
  {
    "text": "My Uber driver had a panic attack mid-ride. Here's what happened. It was early afternoon and I had summoned an Uber driver from my home to take me to a friends house to watch some basketball about 25-30 minutes away.\n\nHe arrives, greetings were fine, asked me how my day was, standard stuff. Not much talking between us, and honestly I don't mind. Car was clean as well!\n\n&#x200B;\n\nAbout 20 minutes into our drive I notice he's sort of glancing in the rearview at me like he wants to say something, he starts kind of breathing deep breaths and says: \"Sorry I have to pull over.\" I reply: \"Ok is everything alright?.\" He says \"Sorry having a panic attack.\"\n\nI remained calm and told him, \"Ok that's fine man, I have panic attacks too, I'm not going anywhere important, take your time.\"\n\nLuckily he was able to pullover, we were in a residential area with a hill next to us and side walk.\n\nHe wasn't really speaking much at this point and I told him: \"I know when I have these attacks I like to be alone, don't worry I'm not in a hurry, I'll be over here on the curb playing games on my phone take your time, let me know if you want to call anyone.\"\n\n&#x200B;\n\nAbout 20-30 minutes later, I told him I could drive him the rest of the way so he could finish his trip and make money, he said to give him a few more minutes. He was able to calm down enough to drive us. We arrived fine, I tipped him told him this is my number if he needs to talk with someone with anxiety as well and went on our ways. I think fresh air and giving him space helped him instead of worrying about finishing his trip with me. Anyways just a small story I had today. Cheers",
    "source": "Reddit",
    "timestamp": "2021-04-29T06:00:00",
    "user_id": -3043471208225859575,
    "subreddit": "Anxiety"
  },
  {
    "text": "I was thinking why this sub has a lot more upvotes than comments, realized people are too anxious to comment,lol edit: welp reaching over 2000 upvotes makes me anxious to post anything here again, so I guess this will be my only post :p",
    "source": "Reddit",
    "timestamp": "2018-01-31T09:51:31",
    "user_id": 4121077392569365846,
    "subreddit": "Anxiety"
  },
  {
    "text": "Have my first real, adult, job interview today! Not only that, but I also managed to drive by myself in city traffic! Two small victories 😊 ",
    "source": "Reddit",
    "timestamp": "2019-02-26T16:08:35",
    "user_id": -6866233333239414008,
    "subreddit": "Anxiety"
  },
  {
    "text": "1. Anxiety makes it hard to go to sleep 2. Depression makes it hard to get out of bed 3. Drink coffee for a boost 4. Caffeine makes anxiety worse 5. Repeat Just one of the hellish cycles that anxiety gets me caught in. Can anyone else relate?",
    "source": "Reddit",
    "timestamp": "2019-09-16T21:07:27",
    "user_id": 6729688567176691628,
    "subreddit": "Anxiety"
  },
  {
    "text": "Do you ever stay up late cause it’s your time to just exist? If I go to sleep then the next day is gonna come so much faster, but if I stay up late I can just exist and not have to deal with the world and I can just be in my little bubble. I don’t have to live, I can just exist, just be. Everything is quiet and calm and I have no responsibilities and nothing that I HAVE to do besides exist. The next day will come by so fast if I sleep and I’ll miss out on this moment of nothingness, and I’m just not ready to deal with the next day yet, I just need a few more hours of just being.",
    "source": "Reddit",
    "timestamp": "2021-11-30T03:44:38",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Today is my cake day and I wanted to post a pic of me smiling for once. Things are starting to look up. ",
    "source": "Reddit",
    "timestamp": "2019-03-12T22:51:15",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "How to order from subway? I've been pretty much suffering from social anxiety all my life...but subway just gives me chills. I just can't never gather the guts to order from a subway. Can someone explain me how to place an order at subway without being judged?",
    "source": "Reddit",
    "timestamp": "2020-03-11T03:45:06",
    "user_id": 7402696779129959871,
    "subreddit": "Anxiety"
  },
  {
    "text": "hey if you know someone has anxiety PLEASE DON'T TEXT THEM \"WE NEED TO TALK\" AND THEN NOT REPLY FOR 7 HOURS FUCK just needed to get that out there",
    "source": "Reddit",
    "timestamp": "2019-08-16T16:51:52",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "5 Things you don't realise you're doing because of your high functioning anxiety... 1. You're nice and easy to be around but you people please too much\n\n2. You obsess over things that other people probably don't even notice \n\n3. You're consumed by every mistake you make by beating yourself up over it\n\n4. You know you're capable but you don't fully believe in yourself \n\nAnd\n\n5. In every situation the worst scenario is your biggest thought",
    "source": "Reddit",
    "timestamp": "2022-01-05T22:10:43",
    "user_id": 8800979349900807785,
    "subreddit": "Anxiety"
  },
  {
    "text": "Due to severe hand tremors from anxiety I’ve had to quit sketching and inking for several years. Finally am managed enough by medication that I could finally finish this piece :) ",
    "source": "Reddit",
    "timestamp": "2019-02-15T01:55:28",
    "user_id": 4501103665303036909,
    "subreddit": "Anxiety"
  },
  {
    "text": "I DID IT I ORDERED A PIZZA. YESSSSSSSSSSSSSSSSSSSSSSSSS, EVEN THO I WAS SHAKING WHILE GIVING THE PIZZA MAN MONEY I FCKING DID IT. HOLY SHIT I CANT BELIEVE IM WRITING THIS",
    "source": "Reddit",
    "timestamp": "2020-10-19T18:54:28",
    "user_id": -8478182084752419204,
    "subreddit": "Anxiety"
  },
  {
    "text": "My gal Sprankles - she always knows how to comfort me after a bad panic attack 😸 ",
    "source": "Reddit",
    "timestamp": "2019-02-02T03:50:58",
    "user_id": 1439046029424930732,
    "subreddit": "Anxiety"
  },
  {
    "text": "After having really bad anxiety the last couple days, I’ve decided to write out how I feel. Ahem.\n\n**AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAHHHHH!!!!**\n\nThank you.",
    "source": "Reddit",
    "timestamp": "2020-08-13T23:49:55",
    "user_id": 4248222092729514258,
    "subreddit": "Anxiety"
  },
  {
    "text": "Just a friendly reminder that anxiety attacks aren’t always hyperventilating & rocking back and forth. They are also random bursts of irritability, obsessive behavior and nit picking, hypersensitivity, pacing, silence, zoning out. Always look for signs with your loved ones ",
    "source": "Reddit",
    "timestamp": "2017-12-10T21:43:54",
    "user_id": 4018835734488570077,
    "subreddit": "Anxiety"
  },
  {
    "text": "Drawing I made about panic attacks and anxiety...helps me process everything in a new way ",
    "source": "Reddit",
    "timestamp": "2018-03-31T17:13:26",
    "user_id": -3986353773964616987,
    "subreddit": "Anxiety"
  },
  {
    "text": "Anxiety is having a wonderful day ahead of you but not enjoying it because you’re thinking about that 2 minute phone call you’ll have to make in five days. Edit: sometimes I just feel so alone, sometimes more than 1.5k people relate to me. Thank you. ",
    "source": "Reddit",
    "timestamp": "2017-10-02T21:32:04",
    "user_id": -9072237441214456998,
    "subreddit": "Anxiety"
  },
  {
    "text": "After 4 years of GAD and 1 year of agoraphobia - I finally went out to eat by myself... I feel like I can conquer the world! ",
    "source": "Reddit",
    "timestamp": "2019-02-12T01:46:45",
    "user_id": 4039935614611835991,
    "subreddit": "Anxiety"
  },
  {
    "text": "Can we just have a round of applause for restaurants that post their menus online It's sooooo much easier going to a restaurant/café/fast food joint/whatever (for the first time) when you can check out the contents and prices of their menus beforehand, and this especially comes in handy to my socially anxious peeps. Sometimes I see a restaurant that looks promising, but I chicken out because I like to have my order locked and loaded before even setting foot at the place.\n\nAlso, this doubles as a plea to all restaurants- if you didn't alreday do it, I'M BEGGING YOU please post your menus online, whether on your website, your IG story highlights, or in an album on Facebook.",
    "source": "Reddit",
    "timestamp": "2020-11-04T13:06:05",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "I don't think people realize how much strength it takes to pull your own self out of a dark place mentally. So if you've done that today or any day, i'm proud of you. EDIT: I heard the quote somewhere, doesn't belong to me. :)",
    "source": "Reddit",
    "timestamp": "2019-05-29T21:38:54",
    "user_id": -5743326424786836007,
    "subreddit": "Anxiety"
  },
  {
    "text": "Might need a pick me up ",
    "source": "Reddit",
    "timestamp": "2018-09-24T08:43:35",
    "user_id": 2424452245249084206,
    "subreddit": "Anxiety"
  },
  {
    "text": "At the end of my first ever session my therapist said something I’ll never forget EDIT: WOW! Thank you so much guys for your kind words! I’m in the UK and have just woke up to all of this positivity. I knew reddit was an awesome place but this has just confirmed it even more. We all deserve contentment, thank you so much 💕\n\nSo after years of childhood trauma, anxiety and depression I finally got to a stage where I could afford decent therapy and had my first session today. My therapist seems really nice and her little room was the perfect environment for me to feel comfortable talking.\n\nAt the end she asked me what I wanted from therapy. As I was telling her all about me and my life, I was constantly worried about her thinking I was overreacting, judging my stories or thinking them not serious enough to require therapy and that I was just a weak person. She looked at my blankly and said ‘is it a big deal for you?’ I said, ‘yes, massively’ and she just simply replied ‘well then it’s a big deal...’, and just shrugged her shoulders and started talking about our next session.\n\nHonestly it was like an epiphany. I realised that if something is a big deal in MY universe, then it is a big deal because it’s me that matters and someone else not thinking it’s serious does NOT invalidate that. I’m always so anxious that my problems will seem silly to someone else, but actually if they really care about helping you get through it, they won’t judge the nature of the problem but try and help you through it anyway because they know it’s a serious problem to you. Your problems are all valid and they’re all worth fixing guys, don’t ever forget that xx",
    "source": "Reddit",
    "timestamp": "2020-07-13T19:18:59",
    "user_id": 3492270040863024957,
    "subreddit": "Anxiety"
  },
  {
    "text": "I was scared of leaving the house but I managed to push myself and it was pretty ",
    "source": "Reddit",
    "timestamp": "2019-02-25T16:27:42",
    "user_id": 2392122015795785902,
    "subreddit": "Anxiety"
  },
  {
    "text": "I once asked my psychiatrist why am I tired all the time and he took out his phone, turned on the torch and said to me, “If I leave the torch on, it will drain the energy of the phone. That’s what anxiety does to you and that’s why you don’t have any energy left for other things.” I thought it was an interesting way to look at it and wanted to share with you all.",
    "source": "Reddit",
    "timestamp": "2022-03-20T13:59:57",
    "user_id": 7218451642679704103,
    "subreddit": "Anxiety"
  },
  {
    "text": "Any other Americans here feel like they’re on the verge of constant panic attacks since the inauguration? I’m a woman. I’m a person of color. I have chronic pain and autoimmune diseases.\n\nI literally cannot read or watch the news because there’s constantly a new reason for my anxiety to spike. Which I hate, because I try very hard to be informed and aware.",
    "source": "Reddit",
    "timestamp": "2025-02-02T03:31:55",
    "user_id": -4741456415099237552,
    "subreddit": "Anxiety"
  },
  {
    "text": "When you're calm and relaxed ",
    "source": "Reddit",
    "timestamp": "2018-07-19T10:06:44",
    "user_id": 2702340898612514752,
    "subreddit": "Anxiety"
  },
  {
    "text": "To whoever is scrolling through Reddit right now, here’s your reminder... Unclench your jaw. Drop your shoulders. Take a deep breath in and hold it...and slowly let it go. \n\nHave a wonderful Monday, beautiful! 💛",
    "source": "Reddit",
    "timestamp": "2020-12-21T17:40:10",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Anxiety is when you can't do anything, because you're worried that you're gonna do it wrong. ",
    "source": "Reddit",
    "timestamp": "2020-07-24T17:02:58",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "i experienced the worst panic attack i’ve ever had. this is my bunny, Chicken, helping me feel better ",
    "source": "Reddit",
    "timestamp": "2019-02-06T00:23:09",
    "user_id": -4544035799252369063,
    "subreddit": "Anxiety"
  },
  {
    "text": "Anybody else ever find themselves staying up late purely to make it feel like there’s more time between now and tomorrow?? I have work in the morning and my brain is like “if you stay up til 1 then you have another half an hour to relax before going to sleep & waking up anxious for work”",
    "source": "Reddit",
    "timestamp": "2020-05-27T23:31:34",
    "user_id": -7297573940442394180,
    "subreddit": "Anxiety"
  },
  {
    "text": "I WENT TO THE GYM AND I DIDN’T DIE!!! (I’ve had public workout anxiety since elementary school) ",
    "source": "Reddit",
    "timestamp": "2019-03-04T22:31:41",
    "user_id": 5251805063285510050,
    "subreddit": "Anxiety"
  },
  {
    "text": "This is the first time I have been to the movies since getting PTSD and the first time EVER going to a movie solo!! Had lots of anxiety, did it anyway, and now feel super badass! ",
    "source": "Reddit",
    "timestamp": "2019-03-29T22:58:19",
    "user_id": -4872580453015430955,
    "subreddit": "Anxiety"
  },
  {
    "text": "Anxiety is waking up 3 hours before your alarm and not being able to fall back asleep because you're worried you won't be able to fall back asleep. Thanks brain.",
    "source": "Reddit",
    "timestamp": "2019-08-08T15:03:35",
    "user_id": -4614077151194604508,
    "subreddit": "Anxiety"
  },
  {
    "text": "It's so frustrating when society wants to be all \"mental health awareness\" but when it comes to the actual symptoms of anxiety and other mental illnesses or being slightly low functioning, you're suddenly condemned for showing them The company that I worked for: \"Hey it's mental health week! Here is a pdf on how to treat people with kindness and always be mindful of others and what they might go through!\"\n\nThe same company after mental health week: \"Oh what? You're overwhelmed with stress and you're showing side effects of the workload you're carrying while panicking and taking a breather? Meet me at the office after work because this behaviour is unacceptable and unprofessional compared to your neurotypical co-workers that can carry the job normally.\"\n\nEDIT: holy shit, didn't expect this to get 2k+ upvotes in less than a day. Thanks guys for the rewards, I don't know how reddit rewards work but thanks!\n\nI feel less alone when it comes to this subject but at the same time it's sad and upsetting to know that this problem is everywhere and the mental health when it comes to society has a loooooooong way till it's normalised like a physical illness. Sending my support to you guys and I hope the world can eventually treat you better without being gaslit <3",
    "source": "Reddit",
    "timestamp": "2021-05-07T14:10:26",
    "user_id": 7315519793764617653,
    "subreddit": "Anxiety"
  },
  {
    "text": "Ain't THAT the truth... ",
    "source": "Reddit",
    "timestamp": "2013-03-06T15:38:05",
    "user_id": 1108686959350863023,
    "subreddit": "Anxiety"
  },
  {
    "text": "Trying to sleep with anxiety is like trying to sleep with relentless pop up ads in your mind ",
    "source": "Reddit",
    "timestamp": "2019-08-10T13:16:23",
    "user_id": -633036927082556253,
    "subreddit": "Anxiety"
  },
  {
    "text": "I'm so anxious while doing schoolwork that my fitbit thinks i'm working out ",
    "source": "Reddit",
    "timestamp": "2018-04-09T16:52:28",
    "user_id": -6124001826312287313,
    "subreddit": "Anxiety"
  },
  {
    "text": "I wanted to share my new embroidery with you all as a reminder of your value ❤ ",
    "source": "Reddit",
    "timestamp": "2018-10-21T15:05:16",
    "user_id": 9013438020452543118,
    "subreddit": "Anxiety"
  },
  {
    "text": "Today is a hard day. My cat knows exactly when I’m having a panic attack and cuddles with me until I calm down. Animals are magical. ❤️ ",
    "source": "Reddit",
    "timestamp": "2019-01-31T20:14:56",
    "user_id": -7976810837967047886,
    "subreddit": "Anxiety"
  },
  {
    "text": "I FUCKING HATE SOCIAL ANXIETY BECAUSE YOU’RE SCARED TO TALK TO PEOPLE BUT ALSO DYING TO TALK TO PEOPLE AND HANG OUT AND RELAX AND HAVE FUN AND NOT BE ALONE AND LONELY AND FEEL LIKE SHIT BUT YOU DO FEEL LIKE SHIT BECAUSE YOU CAN’T EVEN RELAX ENOUGH TO TALK TO PEOPLE WITHOUT OVERTHINKING EVERYTHING ",
    "source": "Reddit",
    "timestamp": "2017-09-25T01:22:54",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Anyone else feel like they are wasting their life by focusing on just having the day be over - but every day? Every day I have this anxiety about work, and every day I tel myself “well it’ll be over at 5pm” and then I have the evening but I go to bed very early because I’m tired of being anxious all day and then do it all over again in the morning. I feel like I’ve lost months of time like this. I don’t want to let my life disappear into just waiting for the days to be over.",
    "source": "Reddit",
    "timestamp": "2020-09-14T12:21:39",
    "user_id": 643847405601230929,
    "subreddit": "Anxiety"
  },
  {
    "text": "My family isn’t the most understanding when it comes to my anxiety so I lean a lot on my cats for support. I did some photo art about how I see them. ",
    "source": "Reddit",
    "timestamp": "2018-09-03T03:07:49",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "I made a lil comic based on a post I saw here about work while having anxiety. so here it is. ",
    "source": "Reddit",
    "timestamp": "2017-09-30T11:09:00",
    "user_id": -2179753402629728388,
    "subreddit": "Anxiety"
  },
  {
    "text": "Is this also you? Because this is me. ",
    "source": "Reddit",
    "timestamp": "2018-07-28T19:44:21",
    "user_id": 4782938943092693679,
    "subreddit": "Anxiety"
  },
  {
    "text": "You have survived 100% of the panic attacks you’ve ever had. You’re doing damn good! Keep pushing :) ",
    "source": "Reddit",
    "timestamp": "2021-10-25T15:14:15",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Anxiety Pro Tip: Anxiety thrives on your avoidance. If you have an anxiety-provoking task to do, make it your first task of the day. Otherwise, it'll only start to feel scarier and harder to complete in your mind. Avoiding the anxiety-provoking task feels good in the short term because your brain feels like it has avoided some kind of threat. This is one of the reasons why procrastination feels so good! However, avoiding the task just reinforces your belief that the task *is* a threatening one, so the anxiety gets more intense the next time you come to it. \n\nMaking it your first task will eliminate this vicious cycle altogether. You'll likely feel better as you'll get a sense of achievement from \"beating\" the anxiety-provoking thing. There is also the added bonus that it won't be nagging the back of your mind for the rest of the day!\n\nAll credit for this tip goes to u/TomClinPsy who posted it elsewhere but it was removed for some reason. Luckily I had screenshot it because it felt so profound to me.",
    "source": "Reddit",
    "timestamp": "2020-05-20T17:17:45",
    "user_id": -5892349891041843545,
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone else constantly feel like they’ve done something wrong after social interactions? Basically the title. I constantly feel like I’ve done or said something wrong or offensive and somebody is mad at me after social interactions. Especially with my family and friends. Even if the interactions ended positively and with hugs goodbye and such. I don’t have a bad relationship with any of them. I don’t consider myself anti social. I’ve mentioned this to my husband and some friends and have been told it’s all in my head basically(in the nicest way possible). My husband will reassure me that I’ve done nothing wrong and no one is mad at me, but I usually have a really hard time shaking the feeling and sometimes it even lasts into the next day. It happens all the time. He and others will say even if someone is mad at me that they’ll get over it, probably before I even see them again and I shouldn’t worry about it, but for some reason I can’t shake the guilty feeling. Is this just me?\n\nEDIT:  I never expected this post to get the response that it did. I want to reply to everyone, but don’t want to be a broken record either. I’m sorry you all are suffering with this as well and I hope we all find some relief someday. It really helps me to know I’m not alone in these feelings. I hope knowing you’re not alone brings you some relief as well. And I’m nobody special, but if anyone ever needs to talk or share experiences I’m here.",
    "source": "Reddit",
    "timestamp": "2020-05-11T07:06:16",
    "user_id": -9167139962365185033,
    "subreddit": "Anxiety"
  },
  {
    "text": "Service dog senses and responds to owner's oncoming panic attack ",
    "source": "Reddit",
    "timestamp": "2018-07-17T20:23:23",
    "user_id": 5974714988465973503,
    "subreddit": "Anxiety"
  },
  {
    "text": "FUCK this disorder. That is all.",
    "source": "Reddit",
    "timestamp": "2020-10-22T15:05:06",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone else get worried/panicked that they’re wasting years of their life being anxious and that one day you’ll look back and see how much of your life you spent feeling negative, never to reclaim those years? 😓 This often comes over me and I stress so much that I’ll spend so many years feeling so negative and anxious, only to waste my life doing so and not able to live my life to the full. It sounds dumb I know but I imagine being old and looking back at what should have been some of the best years of my life which were actually tainted.\n\nEDIT: Thank you so much for all your comments/upvotes/awards. I feel a lot better knowing I’m not alone, although I wouldn’t wish this feeling on anyone else! We can do this guys!",
    "source": "Reddit",
    "timestamp": "2020-12-28T20:13:53",
    "user_id": -2487445213512919668,
    "subreddit": "Anxiety"
  },
  {
    "text": "I saw someone say: \"Having anxiety is like that moment where you feel your chair go too far back or missing a step on the stairs, but it's constant\" and I haven't agreed more ",
    "source": "Reddit",
    "timestamp": "2020-11-20T19:32:41",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Anxiety is sending an email and then not checking your email for 3 days because you're scared of seeing the reply. ",
    "source": "Reddit",
    "timestamp": "2017-11-16T20:24:25",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "I don’t think most people understand how exhausting the physical symptoms of anxiety are There’s a lot of physical symptoms such as shaking, fidgeting, heavy breathing, rapid breathing, getting extremely overheated, rapid heartbeat, stomach pain, nausea, bathroom issues, etc. I think most people just assume it’s completely internal, but man it can be exhausting. Especially when you’re in an anxiety-inducing situation that is lengthy, such as a social outing. It can really take a toll on your energy and productivity, even the next day.",
    "source": "Reddit",
    "timestamp": "2020-07-30T20:47:32",
    "user_id": 998976754940069734,
    "subreddit": "Anxiety"
  },
  {
    "text": "I know a lot of us take antidepressants for anxiety so here's a map I made about it ",
    "source": "Reddit",
    "timestamp": "2018-10-27T02:31:51",
    "user_id": -3986353773964616987,
    "subreddit": "Anxiety"
  },
  {
    "text": "Having anxiety and depression at the same time is not have enough energy to get up and brush your teeth but then anxiety making you worry about loosing all of your teeth till you get up and brush your teeth ",
    "source": "Reddit",
    "timestamp": "2020-06-11T05:14:10",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "I don't think a lot of people realise how much of a disability anxiety can be. Confidence is 75% of the battle in life. Jobs, partners, friends, etc. it's all down to being confident. You may not actually know what you're doing but being confident will convince all those around you. \n\nWith anxiety, you will be constantly doubting yourself, thinking you can't do it. Trying to talk yourself out of daunting situations, and as such struggling to grow as a person.\n\nIt can be hard for people to understand how much of a disadvantage this puts you in. It's harder to make friends and socialise, date, work, and even things like phoning the doctor, driving, and shopping can feel like too much to handle. \n\nConstant anxiety is so incredibly unhealthy for your psyche yet people without anxiety often can't understand this. Instead we appear a bit shy, maybe even lazy, but they don't know what it feels like to have this affliction",
    "source": "Reddit",
    "timestamp": "2022-05-25T10:55:18",
    "user_id": 1766014128018581792,
    "subreddit": "Anxiety"
  },
  {
    "text": "Anyone else more anxious about COVID restrictions being lifted than they were about them being implemented? I have adapted really well to the social isolation and working from home thing. I have a great routine now (way more balance with work/life/health than I did pre-covid) and love having more time to spend with my pets, reading & contemplating. All the zoom meetings for work and maybe 1-2 virtual “catch ups” with friends every week are adequate for me socially. \n\nHowever when I think about how I’ll have to go back to my typical 8-5 grind with a 2 hour commute on top of those hours, I feel super anxious. Anybody else in a similar boat? \n\nNote I’m not saying I hope covid continues to thrive, I know it has had a severely negative impact on many people. I am just anxious at the thought of returning to what was my “normal life” that I hated.",
    "source": "Reddit",
    "timestamp": "2020-04-27T06:13:22",
    "user_id": -7778979960112071742,
    "subreddit": "Anxiety"
  },
  {
    "text": "I painted health anxiety... At least how it feels to me. ",
    "source": "Reddit",
    "timestamp": "2017-01-26T19:30:27",
    "user_id": 4119259022978598209,
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone else ever take out your ear buds to make sure no one else can hear what you're listening to? ",
    "source": "Reddit",
    "timestamp": "2018-10-07T04:17:51",
    "user_id": -2810090048855493134,
    "subreddit": "Anxiety"
  },
  {
    "text": "Feeling so proud of: -present me- for going to my exercise class even though I was late and was anxious people would be mad. -past me- for getting up the guts to start going to the class in the first place. That was super scary! Now it’s a routine it’s easier to go. ",
    "source": "Reddit",
    "timestamp": "2019-03-22T00:49:05",
    "user_id": -4872580453015430955,
    "subreddit": "Anxiety"
  },
  {
    "text": "I actually did it. Found an amazing new job in a much better city, faced my boss to quit my current job. Found a house, turned on utilities, and scheduled movers. I'm not going to lie. It was hell. Every step of it was panic attacks, fear, and a rollercoaster of emotions. But I did it. And now I have such a massive feeling of relief. It really made clear that the only way to deal with things is literally just to face them head on. I wasn't going to have this amazing new house or job unless I pushed myself through. Period. \n\nIf you're going through something and its hard to follow through, or hard to even start. Just try and think about the end goal, not the process. It doesnt make it easy. But it gives you just enough motivation to keep taking one more small step at a time. As Dory says, \"just keep swimming\".",
    "source": "Reddit",
    "timestamp": "2020-07-21T23:03:52",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "I don’t know who needs to hear this, but, unclench your jaw and relax your shoulders. Yes that’s it, relax, you deserve it. :)\n\nEdit: every time I get a notification for my post, it reminds me to do this lol.",
    "source": "Reddit",
    "timestamp": "2020-01-30T20:14:45",
    "user_id": 5525051192979616431,
    "subreddit": "Anxiety"
  },
  {
    "text": "Someone stranger sat with me through the car wash My cars covered in salt so I decided to go through a touchless car wash like I have many time before. But as I was waiting something happened with some car in the other line and he looked to be stuck, then I started to panic because what if my car gets trapped in the car wash. It was my time to go, I had cars behind me, I paid and I just couldn't do it. So I got out of my car and asked the car behind me if I they could back up and let me leave as I was having a panic attack and that they could have my paid car wash is they wanted. Turns out it was a mother and her teenage son and immediately this mom is like \"would you like me to go in the car wash with you if that would make you feel better?\" and as I was holding up the line I said sure and so she had her son drive her car and she hopped in my tiny two seater miata, and just sat and talked to me while I drove through the car wash. We just talked about Christmas and she was telling me how she had to sell her house and how her son liked my car and I'm just sitting there shaking like a leaf. And soon enough the car wash was over, we survived, my car didn't break down, and I dropped her back off with her son.\n\nOne of the most wholesome experiences of my life. \n\nIm going to try to find her on my towns Facebook page, try and give her some grocery and car wash money for the trouble. ",
    "source": "Reddit",
    "timestamp": "2024-12-26T23:58:57",
    "user_id": -5126025261649833835,
    "subreddit": "Anxiety"
  },
  {
    "text": "I’m an italian OCD and anxiety sufferer, and I’m here to tell you that it’s going to be okay. I know you probably don’t believe me, but it WILL get better and easier. I know it sounds scary when governments start to put out all of those limitations and lockdowns, but it’s for the better. \n\nIf you’re starting quarantine or are obligated to stay home just like we are, I promise you’ll get used to it. And not used to it in a negative way! There are so many things you can do at home: I baked so many cakes, I’m trying to do the splits, I’m reading all the books I never got a chance to read. Isolation is reaaally not that bad.\n\nWe have the amazing power of adaptation. Every tool you have learned to cope with your anxiety will come in super handy, and you’ll see how strong you are with them. Sometimes I imagine COVID-19 as the boss level of anxiety, and it gets me super pumped lol. It makes me want to kick its ass so much.\n\nIt’s a wild ride but if us italians are riding it out, you’ll ride it out as well!\nSending you all a giant hug. We’re in this shit together.\n\nAnd please, remember this pro tip: check what is necessary to check on the news. And that means check only what YOU as a citizen need to do. Numbers will go super high, then super low, then high and low again... it’s a pain that you really don’t need in your everyday life. If it’s impossible for you to resist the urge, have a trusted loved one tell you the necessary things you need to know: if there are new limitations, if you can go to school / work , what you should do with your hands etc.\n\nEDIT: thank you so much for the awards, I really never thought this would blow up. There are so many comments, I’ll try my best to answer to the most. But as for all the compliments, THANK YOU!! You are all really sweet. You’ve joined the fight with us, you are not alone :).",
    "source": "Reddit",
    "timestamp": "2020-03-13T01:23:58",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Healthy people talk about anxiety as if it’s something you can control... “Just breathe!” “Think positively.” “Worrying only makes you suffer twice.” Ya know, those kinds of saying. \n\nI wish it was that easy. If I could control it, it wouldn’t be called an illness. \n\nThis morning I woke up feeling perfectly fine (which is rare), was sitting on my couch reading then all of the sudden, my heart started beating so fast for no fucking reason, and I started hyperventilating. It took like 2 hours to collect myself and I had no idea what that whole episode was about.\n\nSo don’t tell me it’s something I can control, I had a panic attack while thinking about literally nothing.\n\nEdit: Thank you to all the healthy people that replied to this post saying: “We mean well”. I get that. But it’s not helpful at all, when we’re venting and your first reaction is defensiveness. Sometimes all we want is to be heard. I know this is irrational, but jumping in with a cure sometimes isn’t the best route. \n\nAlso, to all my GAD fellows, thanks for reading & understanding.",
    "source": "Reddit",
    "timestamp": "2020-08-11T10:36:13",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Do what you can with what you have wherever you are. ",
    "source": "Reddit",
    "timestamp": "2019-02-23T15:29:51",
    "user_id": 4876090404766038499,
    "subreddit": "Anxiety"
  },
  {
    "text": "I took a blanket and a hot water bottle out to a homeless man sleeping under the stairs on my apartment building. I'm shaking and feel faint but am proud I did it. It's about 2 degrees Celsius at night where I live right now, for context. As I arrived home late this evening I saw a homeless man sleeping under some building insulation fabric in the outdoor stairwell of my apartment building. \n\nAs soon as I got inside my nice toasty apartment I couldn't stop thinking about how the poor guy must be freezing. I couldn't help but feel such an aching sadness that so many people just would walk past, not doing anything because of their discomfort, just like the discomfort I was feeling. I decided fuck it, show this guy the care and common decency you would want if you were in a similar situation. I found a spare blanket I had, nice and fuzzy and warm, and a hot water bottle I don't use and filled it up with hot boiled water. I was shaking so hard at this point and almost chickened out. \n\nBarely getting my key in the door to unlock my deadbolt as I was shaking so much, I forced myself to walk outside to him with the blanket and hot water bottle. I apologised for disturbing him, and simply said he must be freezing and to keep both items. He told me I was a gem, and thanked me.\n\nIm back inside my apartment now, feeling like I'm about to faint from the adrenalin and starting to cry from the stress of the situation, but I am so proud of myself. I conquered the anxiety today in favour of my gut feeling and desire to act on my belief of kindness to all.\n\nI feel I'm making a big deal out of literally just being a decent human, but it was a big deal for me and my anxiety so I wanted to share the success.",
    "source": "Reddit",
    "timestamp": "2021-07-15T14:20:29",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone use their phone excessively for hours to distract their brain? ",
    "source": "Reddit",
    "timestamp": "2019-07-29T23:15:35",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "People with a mental illness are not lazy. They have to face an internal battle everyday. And we all know loosing the battle is not an option. We literally have the biggest, most important job possible. Keeping ourselves sane and alive. ",
    "source": "Reddit",
    "timestamp": "2018-10-18T03:21:48",
    "user_id": -1343160657327924065,
    "subreddit": "Anxiety"
  },
  {
    "text": "Anyone feels like they live more in their head than in real life? So, I was wondering, anyone feel like this? \nI think I spend more time in my one head than in the real life. I constantly fantasise and I take refuge in books and TV shows. \nI'm very emphatic too, and I usually imagen how is does the characters feels. \nDon’t get me wrong, I know what is real life and what isn’t. But I took comfort in imaginary worlds and usually overindulge in this feelings and worlds. \n\nI feel like life is extremely unpleasant more of the time. When I was younger this could had been seen as \"daydreaming\" but I’m almost 22 years old now… and I don’t know if this is still a good thing.\n\nEdit: Hey! I'm so so happy for all the support in the comments. I just wanted to say thank you to you all! This has been quite emotional for me, being able to see myself in others and the similar things we all live trough. Thank you all for being so amazing!",
    "source": "Reddit",
    "timestamp": "2021-03-11T21:52:02",
    "user_id": -5946239215501198090,
    "subreddit": "Anxiety"
  },
  {
    "text": "I’m a young kid with really terrible death anxiety. For the first time, I’m visiting my grandfather’s grave. Grabbed some ice cream on the way... feeling very nervous but wish me luck, going with a smile for him! :) ",
    "source": "Reddit",
    "timestamp": "2019-04-06T23:47:19",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "I just had an anxiety attack and my friends made fun of me and I'll never hang out with them again I fucking hate them. They have no empathy and they are fucking assholes. I left them and I am on the beach rn because sea calms me down.",
    "source": "Reddit",
    "timestamp": "2020-08-08T20:00:27",
    "user_id": 4533455198597650483,
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anybody else have anxiety on your days off because you are “wasting” it doing nothing? I have been like this for years but I feel it’s been worse lately because of COVID and the fact that I’ve been working from home. I always felt anxious/guilty when I would relax, hangout inside and play video games on my days off by myself. I felt like I was supposed to be doing something productive, exercising the dog, etc. But I was working a more labor intensive job before. I now have a desk call center job and have been stuck working from home since March. So on my days off, if I don’t have plans, I’m still home and feel like I should be out doing something. But some weekends I just want to do nothing, even if it’s beautiful out (I usually pray for rainy days when I’m off so I feel less guilty.) I also hate the heat so when it’s too hot, I don’t want to be outside. AND I usually get house chores done on my first day off so I can relax later but I still am anxious all day because I’m relaxing and playing video games. I feel like I waste my all my days off thinking of things I SHOULD have done and then when I go back to work, I feel like I wasted all my days off thinking of things I should be doing instead of mentally relaxing. I’ve honestly found myself either drinking or getting High more on my days off just so I can forget these feelings and relax.\n\n*Edit to add, I’m also more introverted so making plans with friends can be exhausting but I do it and have fun every time. Recently all my weekends have been jam packed with plans so I wouldn’t feel like this but apparently it doesn’t work that way!",
    "source": "Reddit",
    "timestamp": "2020-08-02T20:52:54",
    "user_id": 4699391046099437008,
    "subreddit": "Anxiety"
  },
  {
    "text": "Do you get anxiety when you feel like you have been too opinionated? Like you get anxious that you've probably spoke about something so strongly and you start thinking of what other people might say? I get anxious thinking that I might be wrong and have spoke about it too much. ",
    "source": "Reddit",
    "timestamp": "2020-07-17T17:11:59",
    "user_id": -6383061818566042784,
    "subreddit": "Anxiety"
  },
  {
    "text": "There are people out there who don't have anxiety Isn't it just such a wild thought that there are people out there who just live their lives? They're not constantly worrying or feeling overwhelmed. They don't have panic attacks. They're able to do whatever they feel like doing! Like, it's so insane to me there are people who can travel the world, or even just function in their day to day lives.\n\nI've only ever known life with anxiety. Although I guess that's better than living a \"normal\" life then developing severe anxiety, I just wish I could have known what it felt to be fearless at some point.\n\nEDIT: I was not expecting this much of a response from everyone, I am very surprised! I am a little overwhelmed by all the comments, so I'm sorry if I don't respond to you but I am reading them! Thank you so much everyone. You are all lovely people, wishing you all the best!",
    "source": "Reddit",
    "timestamp": "2020-11-14T23:44:13",
    "user_id": 7635718743976035359,
    "subreddit": "Anxiety"
  },
  {
    "text": "Always afraid of 'getting in trouble' - anyone else? I've always been nervous about 'getting in trouble' - I'm not sure I can even put words to it exactly.  As a kid it made sense, I had super strict parents, but it's followed me into my adult life.  Like at work, I'm always anxious I'm going to get 'in trouble'.  \n\nAnd when I self talk that it doesn't even make sense - like who gives a fuck?  Losing my job would suck but I've never lost a job and my boss says I'm doing well.  And yet I find myself always looking over my shoulder and feeling guilt and anxiety building if anything is going wrong or if I slack off a bit after getting work done.\n\nI wish I could shake the tendency but I just can't seem to.  Anyone else feel this?",
    "source": "Reddit",
    "timestamp": "2021-02-04T17:06:15",
    "user_id": -1598890715448298606,
    "subreddit": "Anxiety"
  },
  {
    "text": "anyone else get surprised when people genuinely like you and want to spend time with you? i almost always doubt someones intentions when they are talking to me. im always worried they think im weird or annoying, and that theyd rather be someplace else. and i almost always think when someone is being nice to me, that they are not being sincere. or when they are telling me something about themselves, they are lying to see if im \"stupid enough to believe it\" or something. i know its dumb and irrational. does anyone know how to let go of this doubtfulness, because im sick and tired of having nearly every conversation be like this. i just want to be able to socialise properly lol. to be honest i think this is less a social anxiety issue and more a self esteem issue but they kinda go hand in hand so",
    "source": "Reddit",
    "timestamp": "2020-09-18T21:48:10",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "I love you and hope you are having an awesome day ",
    "source": "Reddit",
    "timestamp": "2018-07-12T22:28:34",
    "user_id": -9021778083989988491,
    "subreddit": "Anxiety"
  },
  {
    "text": "Anxiety makes you look like an asshole Slow responses to message, or no responses at all.\n\nI was too busy battling my mind to make time for you.\n\nI’m sorry. \n\nEveryone must hate me.",
    "source": "Reddit",
    "timestamp": "2020-06-24T05:03:00",
    "user_id": -1227809406875878799,
    "subreddit": "Anxiety"
  },
  {
    "text": "U know the feeling when you're really anxious about something, and then you actually do it and it's not that bad 😊😊😊 It feels very nice, idk if this is relatable to other people",
    "source": "Reddit",
    "timestamp": "2020-08-05T19:11:23",
    "user_id": -170086877406841598,
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone get restless on their day off because they know they have to go to work the next day? ",
    "source": "Reddit",
    "timestamp": "2021-04-11T19:44:34",
    "user_id": 5811227064740526895,
    "subreddit": "Anxiety"
  },
  {
    "text": "Just realized I've gone 195 days without self harming! I'm so close to 200, and I never would've thought I'd come this far! Edit: Thank you guys so much for all of your nice comments, I read all of them and the support here is so inspiring!",
    "source": "Reddit",
    "timestamp": "2020-10-01T18:42:28",
    "user_id": -8188786188582128646,
    "subreddit": "Anxiety"
  },
  {
    "text": "I stopped existing to the world for three years after graduating college. Last week, I posted about attending my first full time job interview. I wasn’t expecting anything, I was proud of myself for being brave. Tonight, they offered me the position. I AM A PERSON AGAIN. I AM REAL. I EXIST. ",
    "source": "Reddit",
    "timestamp": "2018-12-12T23:07:04",
    "user_id": 2299828370958000016,
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone feel depressed that their anxiety has kept them from experiencing major parts of a \"normal\" life? I barely went out with friends when I was in high school. Always heard about my friends going out to parties, but I never went to one myself. In university, I avoided going out with friends, and mostly kept to myself. At the time, I didn't realize I had anxiety. But now, when I look back, knowing that I had anxiety and depression, it makes me really sad that I missed out on socializing and parties. Even though deep down I feel like I would have felt uncomfortable at them anyways. Not sure if that makes sense or not. It's sort of feeling like I wish I could have enjoyed them even though the reality is that I probably wouldn't have enjoyed them much even if I had had the opportunity to socialize more.",
    "source": "Reddit",
    "timestamp": "2019-01-08T19:30:02",
    "user_id": -8167781127088480255,
    "subreddit": "Anxiety"
  },
  {
    "text": "Went and tried to help my neighbor start his car! Pictured is exactly how I felt! ",
    "source": "Reddit",
    "timestamp": "2018-07-27T15:35:01",
    "user_id": 7369133487533806263,
    "subreddit": "Anxiety"
  },
  {
    "text": "[UPDATE] after almost canceling a job interview due to anxiety, I forced myself to go, went in there, and killed it!!! I GOT AN OFFER!!!!!!\n\nI went back to pessimism and expecting the worst after a few days of not hearing back, but I did today, and they offered me the job!!!!! Higher pay, almost double the PTO, amazing benefits... I’M JUST SO EXCITED!!!! \n\nI know on my first day I’m gonna have massive anxiety and second guess everything and wish I stayed in my comfort zone but I don’t even care because this just proves to me that if I push through those nasty feelings I really can do anything!!\n\nThank you so so so much to everyone that gave such kind words of support and encouragement. This has been a HUGE life changing step for me and it’s amazing to be able to share it with all of y’all.\n\nEdit: I promise I’m done bragging on myself after this but I just negotiated a (slightly, not by much but still!) higher salary as well! I’m over the moon, I can’t believe I’m me and I did this haha. \n\nThank y’all, the support in this sub is unbelievable and I’m so glad these posts were able to motivate people. :) every single one of y’all has it in you!",
    "source": "Reddit",
    "timestamp": "2019-07-02T22:52:59",
    "user_id": 724670550108838188,
    "subreddit": "Anxiety"
  },
  {
    "text": "Anyone ever get a surge of anxiety whenever your phone rings? Every time it goes off I just think “Fuck. I’m in trouble”. ",
    "source": "Reddit",
    "timestamp": "2019-02-17T09:18:33",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "I saw a saying that read \"Never get so comfortable in pain that you forget happiness is still an option\" Just thought someone might need this.",
    "source": "Reddit",
    "timestamp": "2019-05-22T12:32:23",
    "user_id": -5743326424786836007,
    "subreddit": "Anxiety"
  },
  {
    "text": "I DID IT. I FUCKING DID IT. \n\nI have extremely bad driving anxiety and I have been stressing about this trip for months and today was the day. I drove 2 hours ON THE HIGHWAY!!!! I WENT LIKE 100 km/hr!!!!! and then 2 hours back (in the dark!!!) !!!!!!!\n\nI bought myself a whole pizza when I got there and SMASHED IT BC I FUCKING DESERVED THAT SHIT hahahahah\n\nIt’s literally 1:45 am and I’m so fucking happy. If you’re reading this and you’re too scared to do something, DO IT. On the other side of fear is freedom. I feel like I just beat a boss level. \n\nGood night guys, sending you all good vibes.\n\nEdit: Thank you so much for all your lovely comments and to whoever gave me gold! I’ve posted about this issue on this sub for a while and I’m so grateful for all the support I’ve received. Wishing you all the best. 💖",
    "source": "Reddit",
    "timestamp": "2019-07-17T13:50:43",
    "user_id": "anonymous",
    "subreddit": "Anxiety"
  },
  {
    "text": "If you're reading this it means I did it I'm really socially anxious and thinking about posting this is making it hard to breath and making me shake but I'm trying to get better and if you're reading this then it means I am taking a small step towards my goal and this is my first post so I'm even more anxious. I'm trying so hard from crying and deleting this post. I've probably wrote 50 different sentences and deleted them thinking it's not good enough and that people would be upset. I really don't want to but I got to try. It's been 15-20 minuets since I started to type all of this  and I'm really  scared on posting it. Please don't be too hard on me... I'm sorry for  the mess of the post  but if you're reading this it means I did it and thank you for reading.",
    "source": "Reddit",
    "timestamp": "2019-11-23T09:02:54",
    "user_id": 3882276517884245486,
    "subreddit": "Anxiety"
  },
  {
    "text": "anyone else get anxiety attacks from memories of bad/cringy/nasty stuff from the past? I feel like I've become a shit ton better as a person, but there are those nights that make me relive all those bad moments and I beat myself up so much that I get seriously messed up. \n\nWhat I wouldn't give to go back and do it all over the right way again..That way, I might've made better friends who would've lasted through maybe?\n\nOr maybe these experiences, they've made me better as a person? They've shaped me? I dont know at this point.\n\nedit - didn't think so many people struggled w this. Awful stuff, but we learn from them and grow as people? take care, all of you, xx",
    "source": "Reddit",
    "timestamp": "2020-05-17T01:42:46",
    "user_id": -8171354255658702574,
    "subreddit": "Anxiety"
  },
  {
    "text": "You ! Reading this ! Reminder to untense your jaw, let your shoulders drop and your head settle comfortably. Take a deep breath in and out. You're safe. You're okay. ",
    "source": "Reddit",
    "timestamp": "2020-12-30T00:43:10",
    "user_id": -9032737111209649562,
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone else get angry at themself for not being the person they want to be because of their anxiety? As the title of the post suggests, I get angry at myself for not being able to speak up when I should, say things in meetings when I should (for fear of being judged, looking stupid etc). It's like I have a real version of myself in my head that I want to be and I get annoyed at the anxious, insecure version of myself that I feel I am forced to show to the world because of my anxiety. Does anyone else have this feeling? I beat myself up daily for not feeling able to be there person I want to be particularly in a work context as often I feel I can't speak out in meetings in particular or when someone says something I disagree with. On the occasions where I do speak out I fear it comes across as aggression. It's a daily battle I feel I struggle to win.",
    "source": "Reddit",
    "timestamp": "2022-08-23T17:06:33",
    "user_id": -528082941879104746,
    "subreddit": "Anxiety"
  },
  {
    "text": "People with anxiety disorders are some of the most mentally toughest bastards in the world. Particularly those that have suffered for years. I know this much is true. ",
    "source": "Reddit",
    "timestamp": "2022-07-12T04:22:37",
    "user_id": 3693557078030811151,
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone else get anxious when being yelled at, or just hearing someone raise their voice? I've noticed here recently that my chest gets tight and I can hardly breathe when being yelled at or hearing someone raise their voice in general. Does anyone have a way to calm themselves when this happens?",
    "source": "Reddit",
    "timestamp": "2020-07-27T04:12:11",
    "user_id": 907765636631529920,
    "subreddit": "Anxiety"
  },
  {
    "text": "I hope this can be helpful for those who get anxious. I’m still learning 🤞🏼 ",
    "source": "Reddit",
    "timestamp": "2018-05-02T14:28:14",
    "user_id": -697394444981209434,
    "subreddit": "Anxiety"
  },
  {
    "text": "Does anyone else get anxious after interacting with people, because you felt maybe you acted weird/said something wrong I have this really annoying habit that every time I hang out with friends / have talks with people, afterwards i start obsessing over every word that came out of my mouth. \"Maybe i shouldn't have said that\" \"Maybe i should have reacted differently\"... It's so tiring and it always lasts at least the next day and makes me incredibly anxious. I just want to relax and not feel like I'm a total idiot by just interacting with others. I try to constantly fight it by telling myself i did nothing wrong, but the moment i don't fight it, i get back on the anxiety circle. \n \nCan anyone relate? \n\nAnd if anyone has any helpful tips, that'd be appreciated!",
    "source": "Reddit",
    "timestamp": "2021-08-04T12:51:17",
    "user_id": 2971947510610848377,
    "subreddit": "Anxiety"
  },
  {
    "text": "A Letter to those who don't have FOMO Dear Friend Who Doesn’t Suffer from FOMO,\n\nYour mental attitude surprises me. You are unaffected when you go on Snapchat and see the stories that your friends post when they are at a party without you. The same is true when you go on Find My Friends and you see two of your best friends together while you are at home, alone. You don’t feel like you are missing out on anything special and instead just passively watch, not letting anything get to your head. Maybe you are an introvert and being at large gatherings makes you uncomfortable. I understand how you can find happiness being alone, binging your favorite show.\n\nFOMO, also known as fear of missing out, is a word that eats at my mental health, but not yours. FOMO is defined as the anxiety brought about when you feel like you are missing out on experiences or knowledge. I am someone who always wants to be in the know and wants to be included. Even if I am unable to go somewhere because I have a conflict, I still want the invite. It’s important to me to feel like I am wanted somewhere, while you can simply appreciate the fact that your friends are having fun.\n\nGiven today’s culture, I am genuinely surprised that you don’t suffer from crippling FOMO. Social media has perpetuated FOMO. When people go out, they attempt to produce FOMO in others by posting on social media. Maybe you understand better than I do that social media can be deceiving. When I am out and someone I am with posts a video, it can seem like the most fun thing ever, when it often really isn’t. Plenty of research has shown the negative effects of social media on mental health. You see other people looking like they are having the time of their lives, and you aren’t.\n\nI really wish that I could just look at something I am left out of and not care. I wish that not being included in something didn’t leave me with terrible anxiety and feeling somewhat depressed. This feeling is consistent with my tendency to overthink things. Something small often becomes an ordeal in my mind as I construct reasons as to why I am alone or not invited, such as no one wants to hang out with me. This mindset becomes frustrating when someone I always hang out with, or used to, has moved to only hanging out with one of my other best friends.\n\nI recognize that we all struggle with problems and hardships in our lives. I’m not saying that just because you don’t have severe FOMO your life is perfect. Instead, it’s just easy for me to imagine that your life is a little better than mine. I am sure that overcoming an obstacle or struggling with being an introvert is difficult to go through as well. With everything going on in our lives, I admire your ability to be independent. I wish I could happily spend my Friday nights alone without the feeling of FOMO.\n\nOne suggestion you might give me to overcome my FOMO is to look at technology and social media less. I know that I need to take a step back from technology, but that is easier said than done. I am simply too obsessed and addicted to technology. To cut technology and social media out of my life is nearly impossible. Another suggestion that I think is more feasible for me is to change my focus. Rather than focusing on not being there, should I be happy for my friends and look forward to being at the next event with them?  Is that your attitude? I understand I need to see things in an optimistic way as opposed to being jealous.\n\nI know you don’t have similar feelings to me. But, my hope is that you can help change my mindset so that I don’t constantly experience FOMO. I hope this letter finds you well, and please help me beat FOMO.\n\nBest,\n\nAbby",
    "source": "Reddit",
    "timestamp": "2022-04-24T23:20:16",
    "user_id": -9145273321244659351,
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO life I’m 20 and I’ve never been clubbing and I don’t have a proper group of friends I can go out with and I have strict parents that don’t let me stay over at friends houses. I see everyone around me gaining many memories and living their lives and having fun. Every time someone tells me about a road trip they went on with their friends or something fun they did I get this nagging feeling In my chest call it jealousy but I just feel like I would’ve really enjoyed that experience too. I feel lonely most of the time and I just can’t get over this feeling. Does anyone have any helpful advice?",
    "source": "Reddit",
    "timestamp": "2021-04-13T07:21:08",
    "user_id": 5175024595338945831,
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO on sunny days  Do you guys ever feel FOMO when the sun is out?\n\nLike if you're indoors and have no plans, but it is sunny outside, do you feel a sense of unease if you're indoors?",
    "source": "Reddit",
    "timestamp": "2020-05-31T14:51:09",
    "user_id": -3219869103187240624,
    "subreddit": "FOMO"
  },
  {
    "text": "ETFM AKA FOMO https://finance.yahoo.com/news/fomo-corp-launches-indoor-air-110000159.html\n\nChicago, IL, Feb. 22, 2021 (GLOBE NEWSWIRE) -- FOMO CORP. (US OTC: ETFM) is pleased to announce that it has launched Indoor Air Quality (IAQ) as-a-Service (IAQ...",
    "source": "Reddit",
    "timestamp": "2021-02-22T12:23:09",
    "user_id": 4463771979829240710,
    "subreddit": "FOMO"
  },
  {
    "text": "Always feel left out Anyone else always feel alone? I’m an only child and always felt left out but as I get older it just gets more intense. My dad just died & my family has only grown even more distant. I constantly seeing people on socials all out and about having fun & I never really get invited places. I always seem like the last option. They’re like “oh let’s hangout soon!!” And I’m never thought of to be invited. Idk I just always feel so left out. Especially on weekends… anyone else?",
    "source": "Reddit",
    "timestamp": "2022-03-13T00:10:47",
    "user_id": -5587239217005342395,
    "subreddit": "FOMO"
  },
  {
    "text": "Anyone have \"covid fomo?\" I feel like I'm missing out on so many social things because covid won't allow us to. I know everyone is on the same boat but every passing day without no end to covid is more time I can't do things and have to put stuff on hold. I just feel like one day I'm gonna wake up old when it's over and be super bitter that I missed out on certain things in life . Certain things I won't be able to get back.",
    "source": "Reddit",
    "timestamp": "2021-11-10T08:05:13",
    "user_id": -9023459572930381505,
    "subreddit": "FOMO"
  },
  {
    "text": "Speaking of \"fomo\" Check out ticker etfm. Its changing its ticker to what......\n\n$FOMO",
    "source": "Reddit",
    "timestamp": "2021-02-20T09:39:10",
    "user_id": 4463771979829240710,
    "subreddit": "FOMO"
  },
  {
    "text": "Please oh god the fomo please ",
    "source": "Reddit",
    "timestamp": "2020-05-07T22:12:22",
    "user_id": 2829323438124600946,
    "subreddit": "FOMO"
  },
  {
    "text": "Is it me or is it my FOMO??? Am I only one who has not made any meaningful friendships in college after months of online college.\nLike I see my college mates tagging each other in FB and writing long ass bday posts as if they have known each other their whole life!!!!\nNGL it kind of makes me feel left out....and let's not even get into the groups that get formed!!!\n\nDon't forget I belong to the weird crapluck 2020 batch!!!\nMight be my FOMO speaking.😅😅😅",
    "source": "Reddit",
    "timestamp": "2021-06-10T10:27:03",
    "user_id": -3570140282287136987,
    "subreddit": "FOMO"
  },
  {
    "text": "Atlanta Airport redefines FOMO. This made me smile. 😊 ",
    "source": "Reddit",
    "timestamp": "2020-07-07T13:58:13",
    "user_id": 2574736047227068325,
    "subreddit": "FOMO"
  },
  {
    "text": "How To Deal With FOMO - Video [How To Deal With FOMO](https://youtu.be/oy27KAv-KUI) \\- Hi everyone, I have just made a video for my You Tube channel on some advice for how to deal with FOMO, this is just what has worked for me I'm not an expert! \n\nHopefully you can take something away from it though! Thank you :)",
    "source": "Reddit",
    "timestamp": "2022-04-06T20:05:41",
    "user_id": "anonymous",
    "subreddit": "FOMO"
  },
  {
    "text": "how to deal with fomo Hey everyone!! i've been dealing with fomo ever since all my friends started attending offline classes, except me ofc. they talk about it in group chats, in calls, this happened, that happened,  i feel so left out.  \n\n\ni've been balling my eyes out every school night, i can't focus on online classes because i just sit through them thinking about what the others might be doing in school, this sucks.  \n\n\nplease help me out.",
    "source": "Reddit",
    "timestamp": "2021-11-06T10:04:14",
    "user_id": 2121705564244840622,
    "subreddit": "FOMO"
  },
  {
    "text": "Im so scared of being left behind I'm kinda sad at the moment, I'm stuck at the same school as I have been at for the last 5 years, and a few of my closest friends have all gone to this big college (junior and senior yr for u I think) so I feel really left behind and sad about it cus I get realllyy bad FOMO. I'm also scared I'm gonna drift from everyone cus I reallyyy don't want to. \nI wanted to go to this place so badly, but my parents wouldn't let me and this sounds selfish but it sucks knowing that my friends are gonna be living life and making new friends and making new memories and I'll never be in them. \nI just found this random community to send to and hopefully I'll make new friends in it ahahah",
    "source": "Reddit",
    "timestamp": "2019-09-12T13:24:42",
    "user_id": 685807535408969262,
    "subreddit": "FOMO"
  },
  {
    "text": "Why do I have this fear of missing out? Im going on 28 soon and sometimes I feel like I missed out on so many opportunities. Yes, I know im young but still. Like there are so many opportunities out there and youre not going to see them anymore. Here's a good example, imagine you really wanted to meet Stan Lee (creator of Marvel), but now that he's dead that opportunity is gone. Or even Larry King, he's gone too. I have some goals in mind myself, I'd love to visit the UK, there are other famous people id like to meet too. I would especially love to meet Alison Brie (Mad Men, Community). She seems so nice and friendly. Or even Maisie Williams from Game of Thrones. I also like Betty White, now imagine meeting her before she passes.THESE opportunities im talking about. There are once in a lifetime opportunities that youre never going to get, and yet I hear \"youre young, you have your whole life ahead of you\". I could have met Stan Lee, that would've been a great experience. Whoever said \"good things come to those who wait\" should end up like something from a Tarantino film.",
    "source": "Reddit",
    "timestamp": "2021-03-24T16:56:54",
    "user_id": "anonymous",
    "subreddit": "FOMO"
  },
  {
    "text": "man. forget this man. i was like yall once. u gotta forget about this stuff goin on. chelsey opening her 3rd shit egg this year is not on my bucket list bro. i louve u all wholsome chungus 69 ",
    "source": "Reddit",
    "timestamp": "2022-03-15T13:01:11",
    "user_id": 6764184147378543749,
    "subreddit": "FOMO"
  },
  {
    "text": "Never knew I had fomo but here i am Yesterday was the farewell of my 10th grade and i couldn't go to it because my mom thinks meeting friends outside once a month is too much or something and most of the friends i care about went had fun took pics and i feel so shit and sad right now even tho i am, or was introverted and this sucks",
    "source": "Reddit",
    "timestamp": "2021-09-08T18:44:26",
    "user_id": 3948308966855703286,
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO about PS5 I didn't care much for next gen consoles for most of the year, but now that release day happened it's plastered all over my youtube feed with unboxings, reviews, and demon souls.\n\nI like to think myself a smart consumer, so deep down I know that getting ps5 at launch isn't super important when new games are still coming to ps4 anyway. And of course I save a couple hundred that I can use else where for black friday. \n\nI just need some validation, patient gamers lend me your energy.",
    "source": "Reddit",
    "timestamp": "2020-11-15T22:38:41",
    "user_id": -5231103998148514325,
    "subreddit": "FOMO"
  },
  {
    "text": "The Fear of Missing Out FOMO ",
    "source": "Reddit",
    "timestamp": "2021-04-05T05:41:41",
    "user_id": -5523336613551906891,
    "subreddit": "FOMO"
  },
  {
    "text": "A few thoughts on FOMO. ",
    "source": "Reddit",
    "timestamp": "2021-01-10T20:58:32",
    "user_id": -199557095623617131,
    "subreddit": "FOMO"
  },
  {
    "text": "i self sabotage when i have fomo i have to quarantine til the 13th, therefore i’m alone and missing out on everything my friends/significant other are doing … it’s mostly with relationships when it’s pretty bad , i feel depressed and alone and not wanted and left out, so the most logical thing to do according to my stupid brain is distancing myself and pushing everyone away. I’m home and my boyfriend is at wildwood (beach) with his fam and i can’t go bc my mom and sis have covid and i have to tend to them (it’s been 5 days ) yesterday is was pretty bad i stayed in my room the whole day i didn’t even eat bc of how sad and alone i felt and i self sabotaged , i posted my ass on instagram knowing it would get a reaction of out my boyfriend (it certainly did, he said he didn’t feel respected and was super mad ) so i woke up today and checked his location .. he’s at the beach so now i don’t want to text him at all today bc he’s having the time of his life and i don’t want to interrupt /bother his perfectly fun day. and now i pity myself and punish my self by not eating/sleeping the whole day bc i feel alone . maybe this is me being emotionally dependent, maybe it’s not fomo",
    "source": "Reddit",
    "timestamp": "2021-09-06T16:46:58",
    "user_id": 7706548262483221122,
    "subreddit": "FOMO"
  },
  {
    "text": "Social Media FOMO It took a while to get over the fomo. Ultimately I had the realization that my attention span on those platforms is literally .5 seconds long. Id be missing out on things I would forget minutes (if not seconds) later.",
    "source": "Reddit",
    "timestamp": "2021-01-17T07:45:58",
    "user_id": 5153771049377764225,
    "subreddit": "FOMO"
  },
  {
    "text": "Why can't I make people talk back to me? I'm a good person, I'm nice, I'm attractive, I'm smart, I'm respectful, I'm calm, I'm funny, I'm hardworking, I'm positive, I'm not awkward, I'm not weird, I'm not stupid, I learned things, I know how to be to people, but I'm an introvert, I don't talk to people, and I never used to, I'm 18, and now I'm trying talking to people, I put myself out there, I'm giving anyone my approval, it's not working, I am not doing anything wrong, but I don't know what it is, I'm showing interest, but people aren't, no one is, this is part of me not getting what I want, I'm trying.. what am I supposed to do?",
    "source": "Reddit",
    "timestamp": "2021-04-30T15:09:16",
    "user_id": -3199410260054840887,
    "subreddit": "FOMO"
  },
  {
    "text": "what can i do against this horrible life changing condition? as the title says..",
    "source": "Reddit",
    "timestamp": "2020-10-17T20:20:39",
    "user_id": -2358673061073381683,
    "subreddit": "FOMO"
  },
  {
    "text": "Happy Cakeday, r/fomo! Today you're 10 Let's look back at some memorable moments and interesting insights from last year.\n\n**Your top 10 posts:**\n\n* \"[a bad case of fomo](https://www.reddit.com/r/fomo/comments/s2nw5n)\" by [u/throwaway19902021](https://www.reddit.com/user/throwaway19902021)\n* \"[Anyone have \"covid fomo?\"](https://www.reddit.com/r/fomo/comments/qqpg61)\" by [u/spankyourkopita](https://www.reddit.com/user/spankyourkopita)\n* \"[A Letter to those who don't have FOMO](https://www.reddit.com/r/fomo/comments/ub73om)\" by [u/SoftwareOk1180](https://www.reddit.com/user/SoftwareOk1180)\n* \"[Always feel left out](https://www.reddit.com/r/fomo/comments/tcuibn)\" by [u/justsad95](https://www.reddit.com/user/justsad95)\n* \"[man. forget this man. i was like yall once. u gotta forget about this stuff goin on. chelsey opening her 3rd shit egg this year is not on my bucket list bro. i louve u all wholsome chungus 69](https://www.reddit.com/r/fomo/comments/teoh6t)\" by [u/Human-Piece-482](https://www.reddit.com/user/Human-Piece-482)\n* \"[Prom fomo and why I got it.](https://www.reddit.com/r/fomo/comments/uv4auk)\" by [u/flyingrobinskydiving](https://www.reddit.com/user/flyingrobinskydiving)\n* \"[How To Deal With FOMO - Video](https://www.reddit.com/r/fomo/comments/txux4q)\" by [u/Thomas\\_Doyle98](https://www.reddit.com/user/Thomas_Doyle98)\n* \"[NAKD nothing but coffee and cigarettes ‘till noon.](https://www.reddit.com/r/fomo/comments/rrd9tq)\" by [u/Beautiful\\_Category\\_8](https://www.reddit.com/user/Beautiful_Category_8)\n* \"[When you FOMO on the NeXT Tesla](https://www.reddit.com/r/fomo/comments/qt8mlo)\" by [u/Suspicious\\_End\\_6685](https://www.reddit.com/user/Suspicious_End_6685)\n* \"[Happy Cakeday, r/fomo! Today you're 9](https://www.reddit.com/r/fomo/comments/qrxwz8)\" by [u/AutoModerator](https://www.reddit.com/user/AutoModerator)",
    "source": "Reddit",
    "timestamp": "2022-11-11T23:25:11",
    "user_id": 7888571070335352686,
    "subreddit": "FOMO"
  },
  {
    "text": "Fear of Missing Out, Retards? Take a look at the true FOMO Stock! FOMO Corporation is an OTC stock, so you can’t buy it on Robinhood, but you can buy In on Schwap, for example.\n\nI own 100K shares.\n\nThey currently trade under the symbol ETFM, but have recently partitioned the SEC to change they’re symbol to FOMO.\n\nIt is a integrated tech company specializing smart lifting, HVAC software and optimization, building disinfection solutions, etc. and are buying up and partnering other companies and partner to achieve this goal.\n\nYou can find out more at [https://www.fomoworldwide.com](https://www.fomoworldwide.com/).\n\nListen in on their recent conference call here: [https://www.conferencecalling.com/recordings/1588083/698013/VCISPREC02\\_698013\\_20210310\\_140337](https://www.conferencecalling.com/recordings/1588083/698013/VCISPREC02_698013_20210310_140337)\n\nYou can see the Slide Deck here: [https://e386a895-b5a4-4d97-8d55-79bfd3e52375.filesusr.com/ugd/14ef60\\_f8c935684fb043bd86d0a10a99b04bac.pdf](https://e386a895-b5a4-4d97-8d55-79bfd3e52375.filesusr.com/ugd/14ef60_f8c935684fb043bd86d0a10a99b04bac.pdf)\n\nI’m a retail investor and am excited about this opportunity. \n\nWhat do you other retards thing? of Missing Out, Retards? Take a look at the true FOMO Stock!",
    "source": "Reddit",
    "timestamp": "2021-03-13T00:59:34",
    "user_id": -7371067934637649145,
    "subreddit": "FOMO"
  },
  {
    "text": "anxiety and fomo during covid i have really bad fomo and always feel left out even when it’s my choice to not do something. this weekend i was supposed to go see some friends but with the rising covid cases in ontario i’m feeling very anxious about it and know it’d be best if i stayed home. but i can’t shake the feeling i’d be missing out on a huge event, even though it’s just my 3 friends, and it’s something we can easily do again in the future. does anyone else have this problem? how do you deal with it right now?",
    "source": "Reddit",
    "timestamp": "2020-09-30T17:23:41",
    "user_id": -8138752621454341429,
    "subreddit": "FOMO"
  },
  {
    "text": "Why you should embrace the joy of missing out ",
    "source": "Reddit",
    "timestamp": "2019-10-11T06:23:07",
    "user_id": "anonymous",
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO - The Fear Of Missing Out and How To Overcome It ",
    "source": "Reddit",
    "timestamp": "2017-08-22T19:13:34",
    "user_id": -1032150303282197536,
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO Investing ",
    "source": "Reddit",
    "timestamp": "2021-01-15T18:39:36",
    "user_id": -871375403197907886,
    "subreddit": "FOMO"
  },
  {
    "text": "The Psychology Behind ‘Fear of Missing Out’ (FoMO) – Applied to Fantasy Premier League and GW33+ ",
    "source": "Reddit",
    "timestamp": "2020-07-04T07:58:55",
    "user_id": 1793663715317680132,
    "subreddit": "FOMO"
  },
  {
    "text": "Ever wonder ? We have fomo because we are indeed 'missing out'? \n\nWho reading this is under 30 , introverted , living out of the city , and lacking real stimulating relationships? ",
    "source": "Reddit",
    "timestamp": "2019-02-05T07:18:24",
    "user_id": 5604703535944557674,
    "subreddit": "FOMO"
  },
  {
    "text": "Fiscally conservative makes me FOMO. I am afraid to spend money and I'm starting to think I don't have a life. I worked as an essential worker and was fortunate to save quite a bit of money during quarantine. In addition to work, I received scholarships from my university and have been saving a decent amount within a year (\\~$40,000). While everyone has been partying, eating out and living their life since safety measures have eased out, I'm still resistant towards spending too much. I want to save for a car and have a safety net when I graduate. I want to hopefully save enough money to start investing and possibly put a down payment on a house. \n\n My friends say I'm too young (24) to worry so much about money, but I don't like spending my money on nails, makeup, concerts, raves, expensive restaurants etc. like other people my age do. My mind is very future oriented, and I feel like my sacrifices of saving money now will pay off later on. I'm also pretty introverted and enjoy reading, watching TV/youtube, making bracelets and working with other hobbies that allow me to stay home and not spend so much. But, there's this constant FOMO that's always playing in the back of my head because I see others my age doing so much outside (and spending so lavishly). \n\nDoes anyone else feel this way? For those older and have more wisdom, am I too frugal for my own good? I would also love to hear how others have amazing experiences while keeping their wallets in tact.",
    "source": "Reddit",
    "timestamp": "2021-09-19T00:33:54",
    "user_id": -3529659295664472406,
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO CORP M&A TARGET ECOLITE WINS LARGE LIGHTING CONTRACT ",
    "source": "Reddit",
    "timestamp": "2021-03-19T17:17:28",
    "user_id": -6864914789987520689,
    "subreddit": "FOMO"
  },
  {
    "text": "NAKD nothing but coffee and cigarettes ‘till noon. NAKD / Cenntro Merger THIS IS HUGE. Nothing but coffee and cigarettes ‘til noon! AH has my spidy senses tingling. Be one hell of a ride next couple of weeks. DD This is a panty dropper!LITERALLY dropping panties for last mile COMMERCIAL EV REAL production on the road now. BIGBIG contracts coming.",
    "source": "Reddit",
    "timestamp": "2021-12-29T17:19:09",
    "user_id": -5138013315063660042,
    "subreddit": "FOMO"
  },
  {
    "text": "fomo fear of missing out (fomo)",
    "source": "Reddit",
    "timestamp": "2021-05-07T14:53:43",
    "user_id": 6372800356823453418,
    "subreddit": "FOMO"
  },
  {
    "text": "I think he finally understood the struggle ",
    "source": "Reddit",
    "timestamp": "2021-01-20T02:17:34",
    "user_id": 5454871538926473188,
    "subreddit": "FOMO"
  },
  {
    "text": "Happy Cakeday, r/fomo! Today you're 8 Let's look back at some memorable moments and interesting insights from last year.\n\n**Your top 10 posts:**\n\n* \"[FOMO on sunny days](https://www.reddit.com/r/fomo/comments/gu0f8a)\" by [u/digital\\_lean](https://www.reddit.com/user/digital_lean)\n* \"[FOMO seriously affects my life negatively in a lot of ways and I have no idea what to do about it.](https://www.reddit.com/r/fomo/comments/hfygs4)\" by [u/PigeonSupreme09](https://www.reddit.com/user/PigeonSupreme09)\n* \"[Atlanta Airport redefines FOMO. This made me smile. 😊](https://www.reddit.com/r/fomo/comments/hmv0hw)\" by [u/foodorphotos](https://www.reddit.com/user/foodorphotos)\n* \"[Please oh god the fomo please](https://www.reddit.com/r/fomo/comments/gfgfv7)\" by [u/SearchingForIllegals](https://www.reddit.com/user/SearchingForIllegals)\n* \"[FOMO in highschool.](https://www.reddit.com/r/fomo/comments/jnfpcu)\" by [u/Affectionate-Poem345](https://www.reddit.com/user/Affectionate-Poem345)\n* \"[what can i do against this horrible life changing condition?](https://www.reddit.com/r/fomo/comments/jd2du7)\" by [u/fightagainstbalding](https://www.reddit.com/user/fightagainstbalding)\n* \"[anxiety and fomo during covid](https://www.reddit.com/r/fomo/comments/j2qi9r)\" by [u/l4ur4k1rst3n](https://www.reddit.com/user/l4ur4k1rst3n)\n* \"[The Psychology Behind ‘Fear of Missing Out’ (FoMO) – Applied to Fantasy Premier League and GW33+](https://www.reddit.com/r/fomo/comments/hkzpkz)\" by [u/FPL\\_\\_Raptor](https://www.reddit.com/user/FPL__Raptor)\n* \"[FOMO Destroyer: How To Attract Shy Girls (Quiet Women, Gamer Nerds, Virgins, Bashful Babes)](https://www.reddit.com/r/fomo/comments/e5oelz)\" by [u/dailymanup](https://www.reddit.com/user/dailymanup)\n* \"[Ways to Earn FREE Cryptocurrency! Don't MISS OUT ON THE CRYPTO GOLD RUSH!](https://www.reddit.com/r/fomo/comments/inuluw)\" by [u/NectarineSweet](https://www.reddit.com/user/NectarineSweet)",
    "source": "Reddit",
    "timestamp": "2020-11-11T23:00:18",
    "user_id": 7888571070335352686,
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO is like battling for the last piece of pizza. You know there isn't enough for everyone so you better get that last piece before someone else does.",
    "source": "Reddit",
    "timestamp": "2019-04-10T01:11:28",
    "user_id": -3560181478827799112,
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO OFFICIAL MUSIC VIDEO ",
    "source": "Reddit",
    "timestamp": "2018-11-21T16:37:18",
    "user_id": 1691855343338072322,
    "subreddit": "FOMO"
  },
  {
    "text": "Who here hates FOMO! ",
    "source": "Reddit",
    "timestamp": "2018-03-13T20:38:02",
    "user_id": 6263555864161351613,
    "subreddit": "FOMO"
  },
  {
    "text": "FOMO Coffee at SXSW ",
    "source": "Reddit",
    "timestamp": "2018-03-12T20:34:45",
    "user_id": 7019672690694498098,
    "subreddit": "FOMO"
  },
  {
    "text": "Mcdonalds fries ",
    "source": "Reddit",
    "timestamp": "2018-02-12T22:38:24",
    "user_id": -3312407685811934210,
    "subreddit": "FOMO"
  },
  {
    "text": "Happy Cakeday, r/fomo! Today you're 9 Let's look back at some memorable moments and interesting insights from last year.\n\n**Your top 10 posts:**\n\n* \"[FOMO life](https://www.reddit.com/r/fomo/comments/mpxafp)\" by [u/D\\_3nise](https://www.reddit.com/user/D_3nise)\n* \"[ETFM AKA FOMO](https://www.reddit.com/r/fomo/comments/lpms0u)\" by [u/s-j89](https://www.reddit.com/user/s-j89)\n* \"[Speaking of \"fomo\"](https://www.reddit.com/r/fomo/comments/lo3rh3)\" by [u/s-j89](https://www.reddit.com/user/s-j89)\n* \"[Is it me or is it my FOMO???](https://www.reddit.com/r/fomo/comments/nwk8fs)\" by [u/selflove\\_AM](https://www.reddit.com/user/selflove_AM)\n* \"[Why do I have this fear of missing out?](https://www.reddit.com/r/fomo/comments/mcaoo6)\"\n* \"[How the f do i deal with fomo](https://www.reddit.com/r/fomo/comments/pcynky)\" by [u/Ok\\_Mixture\\_6873](https://www.reddit.com/user/Ok_Mixture_6873)\n* \"[FOMO about PS5](https://www.reddit.com/r/fomo/comments/juv53c)\" by [u/animepig](https://www.reddit.com/user/animepig)\n* \"[Never knew I had fomo but here i am](https://www.reddit.com/r/fomo/comments/pkgjt2)\" by [u/Shubham\\_Agent47](https://www.reddit.com/user/Shubham_Agent47)\n* \"[The Real Reason Why People Have Foot Fetishes](https://www.reddit.com/r/fomo/comments/n6980o)\" by [u/Jeremy\\_Lerrion5](https://www.reddit.com/user/Jeremy_Lerrion5)\n* \"[The Fear of Missing Out FOMO](https://www.reddit.com/r/fomo/comments/mkdola)\" by [u/Motivational\\_Memos](https://www.reddit.com/user/Motivational_Memos)",
    "source": "Reddit",
    "timestamp": "2021-11-11T23:25:12",
    "user_id": 7888571070335352686,
    "subreddit": "FOMO"
  },
  {
    "text": "Super cool away to consolidate losses! I love finding quick and easy ways to lose my money :)!",
    "source": "Reddit",
    "timestamp": "2021-05-25T19:32:50",
    "user_id": -2100251379331792862,
    "subreddit": "FOMO"
  },
  {
    "text": "Hurry up- might be going to the moon this week! ",
    "source": "Reddit",
    "timestamp": "2021-05-25T12:45:27",
    "user_id": 2907600073269140441,
    "subreddit": "FOMO"
  },
  {
    "text": "Where can I meet new people? Where are places that I can meet new people, and interact with strangers and socialize with people?\nLike public places, and I don't mean anything online",
    "source": "Reddit",
    "timestamp": "2021-05-19T20:15:26",
    "user_id": -3199410260054840887,
    "subreddit": "FOMO"
  },
  {
    "text": "Do You Have FOMO With Girls? ",
    "source": "Reddit",
    "timestamp": "2019-05-22T22:52:46",
    "user_id": -4016335632490817174,
    "subreddit": "FOMO"
  },
  {
    "text": "The latest trend in travel. Watch! ",
    "source": "Reddit",
    "timestamp": "2019-03-15T03:46:53",
    "user_id": 3602399480495342593,
    "subreddit": "FOMO"
  },
  {
    "text": "How To Tell If You Have FOMO Funny Relatable ",
    "source": "Reddit",
    "timestamp": "2017-09-17T03:52:19",
    "user_id": 1277773585324732752,
    "subreddit": "FOMO"
  },
  {
    "text": "How I Fight FOMO Daily ",
    "source": "Reddit",
    "timestamp": "2015-02-19T19:28:01",
    "user_id": 8248671086190628924,
    "subreddit": "FOMO"
  },
  {
    "text": "The Book of FOMO - Chapter 3: The Art of Snapchat ",
    "source": "Reddit",
    "timestamp": "2015-02-15T16:11:30",
    "user_id": 8248671086190628924,
    "subreddit": "FOMO"
  },
  {
    "text": "The FOMO Blog - The Fear Of Missing Out ",
    "source": "Reddit",
    "timestamp": "2015-02-14T22:39:44",
    "user_id": 8248671086190628924,
    "subreddit": "FOMO"
  },
  {
    "text": "Crowdsourced Lousy T-Shirt -- Winter is Coming, don't be the only one without one. ",
    "source": "Reddit",
    "timestamp": "2014-07-18T15:36:24",
    "user_id": 3138707374508560785,
    "subreddit": "FOMO"
  },
  {
    "text": "FULL CRYPTO GUIDE PUT TOGETHER BY ME MYSELF! ALL THE BASICS ABOUT CRYPTO, TO ALL THE ADVANCED MORE DIFFICULT METHODS, TRENDS, STRATEGIES ETC… ",
    "source": "Reddit",
    "timestamp": "2021-05-23T18:22:51",
    "user_id": -5286254956175723176,
    "subreddit": "FOMO"
  },
  {
    "text": "How To Get Investment From Girls - WATCH ONLY if you have FOMO with Women ",
    "source": "Reddit",
    "timestamp": "2019-06-04T01:01:24",
    "user_id": -4016335632490817174,
    "subreddit": "FOMO"
  },
  {
    "text": "Mental Health Awareness Month: I have schizoaffective bipolar type and I just graduated with my BA in English (Magna Cum Laude) at age 28 after dropping out of high school and having intermittently relapsed into psychosis for a duration of 8 hospitalizations. With loving support success is possible ",
    "source": "Reddit",
    "timestamp": "2018-05-28T19:31:47",
    "user_id": 937476659487705246,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Not to brag, but instead of laying in bed ALL day, I laid in bed for MOST of the day, then got up and took a shower. Next up, I conquer the world. ",
    "source": "Reddit",
    "timestamp": "2019-04-15T19:13:30",
    "user_id": 7103227764738654210,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Thank you to the woman who rang me out at Target. You saved my life 😭❤️ I went to target and picked out birthday cards for my parents, siblings, and all my nieces and nephews for everyone’s birthdays next year. I was planning on killing myself after I filled them out. They lady at target who rang me out asked why I was buying so many (I have a big family) I told her I was dying and they’re for my family when I’m gone. I’m sure she thought I had cancer or something. But still. She started to get emotional and started crying then she made me cry. Telling me all kinds of nice things and that my family loves me very much 😭😭 we ended up hugging each other sobbing. After I collected myself in my car I decided to give it another shot just for her. She was so sweet. She indeed saved my life. So thank you to the target employee you have no idea how far your kind words reached ❤️ I am so grateful 🥲",
    "source": "Reddit",
    "timestamp": "2021-11-13T03:49:11",
    "user_id": 1799459761567835891,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My name's Luke and I just got put in a mental health facility but we gotta keep smiling 😊 ",
    "source": "Reddit",
    "timestamp": "2025-04-02T16:41:36",
    "user_id": -7617170254642728770,
    "subreddit": "mentalhealth"
  },
  {
    "text": "PREACH ",
    "source": "Reddit",
    "timestamp": "2017-07-22T14:10:42",
    "user_id": 3184403465799449342,
    "subreddit": "mentalhealth"
  },
  {
    "text": "It’s been 2 months to the day since I last self harmed. I just want someone to be proud of me. ",
    "source": "Reddit",
    "timestamp": "2019-10-20T07:12:42",
    "user_id": -4489226630811961194,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I made a suicide scale. Hoping it could help others. [suicide scale](https://emmengard.com/2019/05/07/suicide-scale/)\n\n\n\nEdit: We have turned off notifications for this post and will no longer be replying to or reading comments for this post. Post replies have become a persistent and painful reminder that is interfering with our ability to grieve and move on. Furthermore, we are not equipped to be suicide counselors. \n\nIf you want to continue talking here and sharing your struggles, that is fine, but we will  not be participating in that conversation. We will not be reading or responding at all, for our own mental health and well being.\n\nIf you are suicidal, please reach out to someone who can help you. We are not those people. Reach out to a friend, a family member or call a hotline. \n\nHere is the link to suicide hotlines by country: \nhttps://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nPlease, take care of yourselves, and stay safe.\n\n-Ariadne Emmengard",
    "source": "Reddit",
    "timestamp": "2019-05-07T22:40:26",
    "user_id": 8085239140364211708,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Anyone else procrastinate going to sleep because they don’t want the next day to come, but then also get anxious about how many hours they have left before they need to get up? This is always a struggle for me. I just want the world to freeze at night time so I can have some peace",
    "source": "Reddit",
    "timestamp": "2021-03-10T04:19:21",
    "user_id": -758370666273548208,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I didnt kill myself! Today, instead of a handful of pills, i got up and put the pills away and ate 6 chicken taquitos.\nI just wanted to celebrate it somewhere. Dont have anyone to celebrate it with me. Good job me!",
    "source": "Reddit",
    "timestamp": "2022-04-02T04:08:13",
    "user_id": 5094822403553616436,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Deep cleaned my room after like a 4 month depressive episode!!! Wish i had gotten a before picture :( but its okay!!! Im super proud of myself and it smells so nice now, and you can actually see the floors lol",
    "source": "Reddit",
    "timestamp": "2025-03-15T20:19:48",
    "user_id": -8576305932085871272,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Want an emotional support animal but can't have one? Get a stuffed animal. I'm a 35m, a grown ass man that has been to Iraq twice, been beaten down in life more than I can count, and I have a stuffed animal.\n\nMeet [Peanut](https://i.imgur.com/xxu64vL.jpg) he is my emotional support stuffed animal. When I'm alone and need someone to talk to he's there to listen. When the PTSD nightmares kick up he's there for you to protect him from the bad. When you get those bad thoughts of hurting yourself just look into his eyes and try to convince him way you think you need to hurt yourself.\n\nBe a grown ass man, get a stuffie!",
    "source": "Reddit",
    "timestamp": "2020-08-30T16:28:10",
    "user_id": -1145743072548121704,
    "subreddit": "mentalhealth"
  },
  {
    "text": "ahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh",
    "source": "Reddit",
    "timestamp": "2022-06-25T16:57:21",
    "user_id": 6017938619111195932,
    "subreddit": "mentalhealth"
  },
  {
    "text": "There is an Arabic saying and it goes like this: “You want to die? Then throw yourself into the sea and you’ll see yourself fighting to survive. You do not want to kill yourself, rather you want to kill something inside of you”",
    "source": "Reddit",
    "timestamp": "2020-01-13T13:18:17",
    "user_id": 664326492270356173,
    "subreddit": "mentalhealth"
  },
  {
    "text": "To the person who deleted their post few minutes ago. I don't really know what's going on with you and maybe most of the people around you can't feel it too.You're not okay and things aren't alright,I get it.\nBut Ending your life doesn't have to be the only way.I have a cynical perspective on most of the things in life So just bear with me.\nIf you give up your life,either nobody will care or you'll hurt the one's that love you even though you don't come across them often.\nTry to handle things one at a time with a thought that you don't have anything to loose Anyway.\n\nAnd please don't forget...\n\n\nThere are people who care about you even if you don't know them.This community cares about you.Share anything you want to.\nWe are here..",
    "source": "Reddit",
    "timestamp": "2019-08-24T18:11:22",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "My doctor asked “Do you even want to get better?” in response to me saying I’m not in therapy because I can’t afford it I’m fuming. She told me I need to tighten my belt and sacrifice other things (like what? Food? Rent?) so I can go to therapy. She (a fucking well-paid *doctor*) told me a story about how was told she needed to see the chiropractor every week for $45 a session, and while she felt that was too much, she just had to ‘move things around’ to make it work.\n\nLast time I was in therapy it cost me $150 a week *with insurance*. The session I just had with her cost me $100, not to mention the cost of all my meds. It’s fucking insane how much all of this costs already. Am I supposed to find that amount under the couch cushions?\n\nAnd what is the insinuation here? Because I’m poor, I *deserve* to suffer from mental illness? You don't think I *want* to be in therapy?\n\nAbsolutely unreal.",
    "source": "Reddit",
    "timestamp": "2021-01-13T15:40:23",
    "user_id": -7020385314328431080,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My wife has passed suddenly I'm 24 and have two children with my wife we was expecting our third when she started cramping it was an ectopic pregnancy which ruptured and she didn't make it.\n\nI wasn't aloud to go to hospital with her because of covid and was trying to come to terms with losing the pregnancy when I got a phone call to come to hospital and given the news I can not believe she's gone. My world has become so dark.\n\nMy daughter is five and is asking where her mummy is I can't begin to think what I'm going to say to her. \n\nMy son is three and has development issues and is happily oblivious. \n\nI'm the stay at home dad my wife was the breadwinner I feel so guilty for worrying about money. Please someone help me I'm so scared of the future. \n\n I love my wife iv never been with anyone else we met at 15 became parents at 19 and married at 21 iv never thought of my life going any other direction than us 4 all moving forwards together she's everywhere I look everybody I see looks at me like I'm an alien now I can't stand the look on people's faces when we go out my wife was very well known in my area from working at local corner shop and I haven't been able to avoid someone we know every single time iv left the house.",
    "source": "Reddit",
    "timestamp": "2021-02-15T13:04:11",
    "user_id": 2800583208231429385,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I survived a school shooting, but now I can’t do anything I’m sure you’ve seen it on the news, Oxford High School got shot up by some selfish asshole. I was lucky enough to get into a classroom, but I could hear the gunshots and the screaming. I can’t seem to do anything anymore. I can’t sleep, can’t eat, don’t have the motivation to get out of bed, everything feels numb. I don’t know what to do. Why did I get to escape and live while 4 innocent people didn’t. I don’t really know what to do and what I expect to gain from posting here, but thank you.\n\nEdit; I’m going to therapy, I will be picking up horse riding and starting art therapy. In an effort to solidify it I went to see Tate Myre during visitation today. He doesn’t look like he did while alive, but I was able to connect with a teacher and we will be hanging out and doing art things together. Thank you for your responses.\n\nI also started playing a stupid little horse game called Howrse that I was obsessed with as a kid. Kinda makes it easier to feel like a kid again.",
    "source": "Reddit",
    "timestamp": "2021-12-03T17:33:18",
    "user_id": 2820949088039802117,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I now understand why so many women hate men... So basically I made a post about me being sexually abused from a young age and needing someone to tell my life story to.  I'm a male and I've gotten loads of dms from creepy dudes trying to get off by hearing  about my sexual abuse history because they thought i was a woman.  Like what the actual fuck.  I'm so sorry it's like this for women.  I literally just want to TALK to someone and it be an adult conversation. ",
    "source": "Reddit",
    "timestamp": "2025-02-16T05:17:47",
    "user_id": 1232789388320362286,
    "subreddit": "mentalhealth"
  },
  {
    "text": "my boyfriend k*lled himself in my apartment  my boyfriend and i got into a bad fight where he ended up putting his hands on me. i told him to get his things and leave my place. i gave him 24 hours and his car was still there. police came, knocked on the door, no answer. i had the worst pit in my stomach, a really bad feeling something wasn’t right. no sounds or movement at all, not even a “fuck off”. i called for a wellness check today and the officers found him in my bedroom. i’m diagnosed bipolar and adhd and i’m having a really hard time. and please dont say ur sorry because i dont want to say “its ok” because its not. none of this is ok. our last interaction was a fight. i didnt answer his last attempts to reach me. he put the latch on the door so i couldnt have stopped him even if i knew. i wanted to be wrong so bad. i dont want this to be real. i cant do this.",
    "source": "Reddit",
    "timestamp": "2024-09-25T06:54:32",
    "user_id": -8259514391896988799,
    "subreddit": "mentalhealth"
  },
  {
    "text": "3 weeks clean. I've painted every time I had a major craving. I'm up to 95 canvases. So an average of 4.5 a day. ",
    "source": "Reddit",
    "timestamp": "2018-05-07T10:06:37",
    "user_id": 7175695249936786437,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Does anyone else feel super motivated and ambitious late at night or around bedtime, and then waking up with absolutely none of those feelings? I can't count how many 3AM's I've had where I thought \"Tomorrow, I'm gonna start doing this.\" or had some big epiphany that gives me a ton of courage to make a positive change and then I just don't feel those feelings the next morning. It's been the case for years and years now. I know exactly what I want to do and how happy those changes would make me, but as soon as I wake up I just go back to wishing and fantasizing about them, feeling like there's a brick wall between me and taking that first step. It's so aggravating never being able to keep my own word, and it's quite psychologically damaging.",
    "source": "Reddit",
    "timestamp": "2021-02-09T09:24:24",
    "user_id": -1235149049599997974,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Just found suicidal ideation in husbands search history. I don’t know what to do. Help? Hello, last week my husband and I had a very huge fight that lasted through the week. We’ve seemed to have smoothed things out but last night I was looking though the search history on his computer and found this. I truly do not know what to do. Please help. ",
    "source": "Reddit",
    "timestamp": "2025-04-09T20:08:59",
    "user_id": -368604667184578643,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Today I'm glad I didn't kill myself yesterday. Yesterday I was in a deep depression ready to end it all, trying to resist the urge. Today I feel stable. I've been for a walk with a mental health group. I've listen to good music.\n\nToday, I'm glad I didnt kill myself yesterday.\n\nEDIT: Honestly I'm really overwhelmed by all the support from you lovely people. I thought no one cared. This is still hard for me to believe.\n\nBless you all. May you find light in the darkness. Strength when you feel weak and the courage to keep going. <3 \n\nWe're all in this together, much love to you guys. xx\n\nEdit: spelling mistakes.",
    "source": "Reddit",
    "timestamp": "2021-03-31T16:54:12",
    "user_id": 6545963381823916986,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Me irl ",
    "source": "Reddit",
    "timestamp": "2018-04-16T15:02:07",
    "user_id": 5072257422379980957,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I got out of bed today :) I got out of bed, I showered, I brushed my teeth, I put on actual clothes, I folded and put away the laundry that's been sitting on my bed for weeks, and I'm eating actual food before dinner time. Hopefully I can also wash the dishes, call my family, and maybe even start a load of laundry, but at the very least, I got out of bed today :)\n\nEdit: Thank you so much for all your support, guys <3 I'm so grateful to have this little community to share with.",
    "source": "Reddit",
    "timestamp": "2020-09-01T19:51:15",
    "user_id": -7239964222112015942,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I Survived a Genocide But I Feel Nothing I managed to evacuate from Gaza, leaving behind the rubble, the bodies, and the memories of the war zone. You’d think getting out would bring relief, a sense of safety—but all it brought me was emptiness. I thought once I escaped, I’d be able to feel again, to grieve for the lives lost, for the people I knew. But I feel nothing.\n\nI’m in a place far from the violence now, surrounded by people who are living normal lives. They go about their day, complaining about trivial things—traffic, their jobs, relationship problems. And I just stare at them. How do they not realize how absurd it all is? I survived hell, saw children torn apart in the streets, watched families disappear overnight, and now I’m expected to care about small talk? I don’t.\n\nEven after I got out, people wanted me to share my story, to talk about the horrors I escaped. But every time I do, I feel detached, like I’m telling someone else’s story. I describe the destruction, the bodies, the screams, but it feels like I’m reading from a script. I can’tonnect to it anymore. It’s like I left my emotions back there, buried under the rubble.\n\nI’ve lost all sense of empathy. When I hear about someone dying, even someone close, it doesn’t register. I didn’t cry when I found out a friend of mine didn’t make it out. I didn’t care when I heard about others losing everything. I go through the motions, pretending to sympathize, but inside, it’s just blank.\n\nPeople think escaping the genocide means survival, but it’s not true. Part of me died there, and the part that made me human never made it out. Now, when I see images of what’s still happening, or hear about others’ struggles, I can’t bring myself to feel anything. I walk past people begging for help, and I feel no urge to stop.\n\nI’m broken in ways no one can see. On the outside, I’m functioning. I smile, I work, I talk to people. But inside, I’m just as destroyed as the streets I left behind.\n\nIt’s been 5 months ",
    "source": "Reddit",
    "timestamp": "2024-09-11T21:37:04",
    "user_id": -8529135859353148745,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My Dad shot himself today.. I don’t know where else to put this but I need to get it out. Today my dad killed himself. He had been battling depression for a long time. Today he got way too drunk (he was a recovering alcoholic) and got in to a big argument with my mom. They were fighting on the front porch while I was in the kitchen making a bottle for my 8 mo son who was sleeping in his crib on the other side of the house. After they were arguing, my dad walked in to the house, shut his bedroom door and shot himself in the head. I was right outside the door when it happened and I can’t get the sound out of my head. Luckily, my son slept through the whole thing and was quickly taken out of the house by his father while I called 911. My eyes hurt but I can’t sleep or close them with out everything replaying through my head. I feel like my life is in pieces and I don’t know what to do. That’s all I can really say...\n\nIf you need help, please get it. Because of a horrible combination of alcohol, guns and depression, my son no longer has the grandpa that he so much adored and I am now with out a dad.\n\nEDIT: Thank you all so much for all the sentiments. I know it’s strange to post something so personal to random people but hearing from all of you makes me feel less alone, I guess. I 100% agree about therapy and I am definitely no stranger to it and the help it gives. Sadly, money is tight and my insurance is shit so if anyone has any resources to help me find a cheaper solution when it comes to therapy, I would be very grateful.",
    "source": "Reddit",
    "timestamp": "2020-07-28T10:58:53",
    "user_id": -7310272117689729876,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Anyone else feeling very behind everyone their age. Like they're accomplishing all these things and I'm just here. Anyone relate?",
    "source": "Reddit",
    "timestamp": "2020-03-26T22:59:28",
    "user_id": -1552704006533202444,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I was inches from committing suicide 6 months ago, today I signed a lease for the nicest apartments in my city. Hang in there. Long story short, over the summer I was planning on driving my car over the edge of a cliff after I dropped some people off on vacation. I was overwhelmed in life and saw no way out aside from ending it all. Felt like a disappointment because I dropped out of college, worked as a personal trainer at a gym where I was taken advantage of and forced to work 16-17 hour days for pennies. Lived in some slummy apartments with no AC and barely had any grocery money. I usually bummed pizza from local Pizza shops at the end of the night when someone hadn’t picked up a carry out order. Sometimes I’d get something, sometimes I’d get told to fuck off. Got on average 3 hours of sleep aside from Saturday nights. Mental health was at an all time low.\n\nI made some changes that started with therapy. After that, I got a lucrative new sales job, love the people I work with, practice Muay Thai weekly, work out every day, and am in a much better place mentally. \n\nIf you think this post is about me rooting my own horn... You’re right. I’m damn proud of the progress I’ve made. Whatever it is you’re going through, keep fighting. Keep waking up every day. Keep on keeping on.",
    "source": "Reddit",
    "timestamp": "2020-12-19T21:59:31",
    "user_id": 5323037448685421667,
    "subreddit": "mentalhealth"
  },
  {
    "text": "People who welcome you back with open arms after ghosting them during a severe depressive episode are like gold Self isolation is horrific and that is all",
    "source": "Reddit",
    "timestamp": "2019-10-16T04:01:30",
    "user_id": -7716941428991553954,
    "subreddit": "mentalhealth"
  },
  {
    "text": "To anyone suicidal tonight, look up the Rappper NF. All he raps about is how to face mental health. He's saved my life many times. He has been a true life safe for me.\nEdit: I’d recommend starting with “Mansion”",
    "source": "Reddit",
    "timestamp": "2020-11-14T02:08:38",
    "user_id": 2812634583666172081,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I'm SO Proud Of Myself I just washed my hair for the first time in a week and a half and brushed my teeth for the first time in a month. I'm so proud right now I could scream. I usually have no energy to even get out of bed. I'm so proud.",
    "source": "Reddit",
    "timestamp": "2022-10-08T02:09:04",
    "user_id": -2865176766263273634,
    "subreddit": "mentalhealth"
  },
  {
    "text": "i’m one month clean of self harm :’) the title says it all",
    "source": "Reddit",
    "timestamp": "2020-09-12T15:29:28",
    "user_id": 7405803420046044265,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Depression does NOT mean feeling sad. Depression is a medical term for functioning below necessary levels Depression, and it’s synonym suppression are commonly used in medical treatment and diagnosis to indicate something is wrong and the affected system can’t adequately contribute to the rest of the body. So basically you can’t think and act in a way that keeps up with your obligations. So it’s not just feeling sadness. It’s not laziness, and it’s not for the sake of gaining attention. If some was experiencing respiratory depression. Would you say” ok but have you tried breathing more?” No? Then cynics and doubters can fuck off.  Ok. I’m done.\n\nP.s. treatment helps depression. It really does.",
    "source": "Reddit",
    "timestamp": "2019-03-27T18:06:30",
    "user_id": 5964986518822121102,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I don't have a lot of people in my life right now, but i wanted to share this: I chose life this morning. I chose my raggedy, rundown broken life. I chose me. And I think I chose well. Edit: I love you all. Thank you :)",
    "source": "Reddit",
    "timestamp": "2019-09-20T13:49:40",
    "user_id": -2667133659706587098,
    "subreddit": "mentalhealth"
  },
  {
    "text": "TODAY I AM 5 YEARS SELF HARM FREE ",
    "source": "Reddit",
    "timestamp": "2018-03-13T16:23:48",
    "user_id": 2124503237435985251,
    "subreddit": "mentalhealth"
  },
  {
    "text": "1 YEAR TODAY WITH NO ATTEMPT SUICIDE AND A MAJOR EPISODE I am so happy today, and never did I imagined I'll be as mentally stable as I am right now!",
    "source": "Reddit",
    "timestamp": "2020-04-25T19:31:27",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "I want to be hugged. I just want to be hugged. I'm going through a lot. I want someone to hug me. It's torture. Why can't I be normal?",
    "source": "Reddit",
    "timestamp": "2020-11-28T14:02:22",
    "user_id": -1606489590600072504,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My husband been having sex with me in my sleep since 2014. I've had two ectopic pregnancies that result in both tube's being removed for two separate pregnancies. Due to the amount of miscarriages I've has sex is painful. I tell him no but he just does it anyway. Should I sue him ? I just found out my husband has cheated on me since I can't please him due to my surgeries.  It was his fault we got pregnant without a doctors supervision monitoring my health. I never knew I was pregnant until it was too late. Should I sue him for emotional damage, physical harm to my body, and my mental health? I need counseling so bad, but I'm afraid he'd go to jail. Should I just keep it in therapy? I can always delete this account.  I just wanted to hear different points of view. I swear I just want to d!3 than go file paperwork.  I wished I knew this wasn't normal.  I'm so fucking lost 😞  . I know people are asking why didn't I speak up? It's cause I thought this was normal in any relationship. \n\n\n\n\n\n\n\n\nI don't know why this post was locked but thank you to that one mom that want to give me a hug.  I desperately need it.😭😭😭. \n\nTO EVERYONE ASKING DID I CONSENT? HOW CAN I IF I'M HEAVILY SEDATED ON SLEEPING MEDS? ..... SOME OF YOU ARE THE REASON I DIDN'T SEEK HELP BECAUSE I DIDN'T WANT TO BE JUDGED ABOUT LETTING HIM DO THIS TO ME FOR YEARS.  \n\nI SAID SUE BECAUSE IF I WANT TO HAVE A FAMILY  WITH ANOTHER MAN I WOULD HAVE TO BE ARTIFICIALLY  INSIMINATED.  THAT COST MONEY I WOULD NEVER HAVE.\n\n I TRULY THOUGHT ALL WIVES DID THIS IN THEIR MARRIAGE SO THEIR HUSBAND CAN STILL BE PLEASED. \n\nI GREW UP IN RELIGIOUS HOUSEHOLD THAT NEVER HUGGED, NEVER SAID I LOVE YOU, NEVER DISCUSSED SEX NOR RELATIONSHIP ADVICE... \n\n I'VE HAD TO LEARN EVERYTHING FIRST HAND. Again, I was 19 yrs old. \n",
    "source": "Reddit",
    "timestamp": "2024-06-22T08:03:39",
    "user_id": -7076687648274756464,
    "subreddit": "mentalhealth"
  },
  {
    "text": "You are not lazy, losing interest in a loved activity could be a warning sign ",
    "source": "Reddit",
    "timestamp": "2020-05-17T13:14:11",
    "user_id": -8617830202941050454,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Just because you’re struggling doesn’t mean you’re failing. Big shout out to all in the community who made it through another day. You’re all amazing. You got this. ",
    "source": "Reddit",
    "timestamp": "2019-02-04T15:22:06",
    "user_id": 6245381005522908461,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Does anyone else feel like they \"can't handle\" everyday life as well as everyone else? Sometimes I feel absolutely convinced that I'm not cut out to handle a healthy work/life balance like everyone else can.\n\nI feel like my coworkers take on so much work compared to myself. They have so many ongoing projects yet I can hardly handle the few that I do have. I know part of this is an illusion because I don't see how they're really handling the stress behind the scenes. Another part of this is my own guilt thinking that I don't deserve my job or the money I make.\n\nI always struggle with these feelings... Does anyone else think about this sort of thing way too much?",
    "source": "Reddit",
    "timestamp": "2020-10-12T14:30:58",
    "user_id": -4688996273277379292,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My daughter is scaring me tonight. No idea how to help. My daughter (10) very suddenly this evening said she feels like she's in a dream/ like she's not real/ like she's a ghost. Said she feels like she's going to die. She doesn't look great, almost like she's sick, but she says she isn't sick except for feeling like she's going to die. Her pulse is normal.\n\nI had her take a shower, brushed her hair and she put on her jammies. Tucked her bed with beach sounds and told her to relax and picture being at the beach. Walked in a couple of minutes later and she's crying.\n\nI'm really worried but completely clueless. My husband thinks it's her ADHD/Adderall, but this has never happened before. She has been very moody and temperamental lately. Can anybody clue me in on possibly causes or where to start?",
    "source": "Reddit",
    "timestamp": "2023-12-09T02:50:29",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "I think that “13 reasons why” is a very bad way of “spreading awareness” As the title suggests, I think that 13RW is a very bad portrayal of mental health, suicide, depression etc. and it shouldn’t be promoted as a show that “raises awareness”, when it’s just harmful. It portrays suicide as something “beautiful” and “meaningful” and not what it really is. And the whole “blame it on other people even though they tried to help me” thing? Nope nope nope, that’s so toxic. Idk if I just feel that way because of my PTSD (an older guy blamed me for his suicide attempt because I didn’t “help him enough” even though I did everything I could and was only 13), but it’s just not really how suicide should be portrayed, in my opinion. Also, the way they show flashbacks of Hannah Baker from when she was alive makes it seem like she’s still alive in some way. They reeeeally push this harmful “suicide is something you choose as a weapon to hurt other people” agenda, when in reality, suicide is often the exact opposite. \nIdk, personally I really don’t like that show, and i think it’s harmful. I once opened up about my suicidal thoughts and depression to a friend, and she was all like “who made you feel that way?” like it was other people’s fault. Like sure, trauma and toxic relationships with people can worsen suicidal thoughts and depression but I just don’t feel like the show portrayed it in a helpful way.",
    "source": "Reddit",
    "timestamp": "2020-05-05T16:51:39",
    "user_id": 3578466875465810216,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Just took a shower after not taking one in a week. Feeling good! Struggled to motivate myself to take a shower, ended up washing my hair in the sink because I didn't want to wash my full body. However yesterday night I had the energy to take a full proper shower and got out all my spa day stuff, like sugar scrub, my skin care products, lotion, and body mist.\n\nHad a full mini spa day and around bedtime I made myself a cup of tea and put on a clay mask. I'm really proud of myself and I don't feel gross anymore.",
    "source": "Reddit",
    "timestamp": "2025-03-16T15:07:59",
    "user_id": -895101734833108061,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I know it sounds cliché, but it’s crazy how much a walk outside can clear your head and get you back to at least a neutral state, if not a positive one. i know that the starting of something like a walk in the moment seems impossible — but i just hope if you’re feeling down, and you see this, that it can be that small nudge you need. \n\nHave a wonderful rest of your day.",
    "source": "Reddit",
    "timestamp": "2021-01-03T23:22:47",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "Cake saved my life 6 months ago i decided  to go to a famous bridge in my country and jump , but while driving there i saw a cake shop that i always wanted to try and i told myself why not eat some cakes before jumping (make it a good last day) so i ate 2 cakes and the cake guy was nice and it calmed me down so i didnt do it , still alive...",
    "source": "Reddit",
    "timestamp": "2022-12-05T10:24:18",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "My boyfriend undressed me without asking. It’s not what you think though. I am usually the most positive, motivated, & outgoing person ever, but with COVID-19 affecting every aspect of my life, it wasn’t a surprise I became deeply depressed. I had been trapped in my apartment for months with no job, money, or motivation. My mentality started shifting to something more cynical as well. One night in particular though, my boyfriend helped catalyze me getting better. It was insanely difficult to get out of bed. Sure I’d get up maybe for an occasional snack or a quick bathroom break but I was just stuck mentally and physically, and in this case I hadn’t left my mattress for days. I wasn’t okay at all. Then one day out of the blue, my boyfriend went into my closet and grabbed me one of his t- shirts, (my) underwear, and (my) shorts. He propped me up and undressed, then dressed me while my eyes swelled up. He didn’t even ask. He just did it. Every time I think about that moment I tear up because it was the most intimate and sweetest thing anyone has ever done for me. I really am so lucky to have such a caring man in my life. I can’t wait to marry him some day. Our relationship is him doing the most selfless acts of love for me, and even though he might not think much of his actions, they mean the world to me. And for an update on my mental, I am doing incredibly better. Don’t want to go too in depth because he deserves all the love on this post. Thank you for reading. ♥️",
    "source": "Reddit",
    "timestamp": "2020-05-25T08:26:40",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "Please brush your teeth, even if it's hard I know it can be hard. I know that sometimes it feels like lifting that brush to your mouth can feel like you're lifting 50 pounds but please do it. \n\nI went to the dentist today for the first time in years. Because I spent so long not being able to brush my teeth I have to have 5 teeth pulled. I have an infection in my mouth and I can't chew on my left side without extreme pain in my mouth. I don't know if I'm going to have the money to fix it. \n\nEven if you don't change your clothes, or shower, or wash your face. Please brush your teeth. Clothes can be washed. Your body can be cleaned. Your face will be okay for another day. \n\nYour teeth will take thousands to fix, and will cause you extreme pain. Do it for future you. Do it so that you don't have to keep from eating for days just because it hurts so much. Do it so that you can keep eating the crunchy foods that you love without fear of breaking another tooth. \n\nDo it for when you're better. Do it for yourself. Because I don't want anyone to deal with what I'm having to deal with now. \n\nYou can do it! I believe in you.",
    "source": "Reddit",
    "timestamp": "2021-12-29T08:53:06",
    "user_id": 2392058063130105087,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I brushed my teeth and washed my face properly for the first time in a while I know..yuck...ive always had difficulty keeping my hygiene up bc of mental illness but always managed to “complete” it anyways since I had to go to school and stuff. Now that its all online and i havent really had reason to go outside it got bad. My skin and teeth were really horrible..Again, thats gross, i know i know. I wonder how you’d explain to someone that mental illness makes hygienic tasks harder without them being grossed out?\n\nAnyways, today I actually properly brushed my teeth and washed my face. My teeth feel super clean. I used an exfoliator and toner and moisturiser and all that stuff with my face. I got water everywhere but It felt nice. My face is soft now. \n\nEven though my room is a dirty mess, I barely got any sleep, and my school work is bad right now at least I did something. I don’t feel completely “awake” if that makes sense but at least I managed to do something today. \n\nThats all :—-)",
    "source": "Reddit",
    "timestamp": "2020-10-08T14:52:55",
    "user_id": 2216586390368883935,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Just had my cousin's memorial on Zoom, and it was atrocious. My cousin recently killed herself. We were close when we were growing up. Her parents were extremely strict and had very high expectations of her, expectations she obviously felt she couldn't meet. \n\nI'm pissed off because in her memorial, not once did they mention it was a suicide. The closest thing I could find to an acknowledgement of that fact was in an obituary posted elsewhere online, where they said she \"succumbed to the pressures of COVID-19\" which is the most bullshit way to sugar-coat a suicide they could've come up with. As someone who has been very very close to taking my own life, having been hospitalized for that very reason just last year, it bothered me to my core that they pretended like it didn't happen. Just sang songs about god, beating around the bush and making it clear that she would be going to \"heaven\" and not \"hell\" even though everyone knows she did the big bad and committed \"sin\". No recognition at all for the pain she had obviously been dealing with silently for her entire life.\n\nI posted on her memorial site, just a quick blurb of some memories I had with her, a nice photo of us when we were young,  and I quick sentence at the end basically saying \"Some of us face our struggles silently, and you never know who could be fighting an invisible battle, so always be there to lend a shoulder to someone, whether they ask for it or not.\" And I linked NAMI and the suicide hotline. \n\nThey fucking deleted my post and asked me to take all references to suicide or struggles out. They reached out to my parents too to try and reign me in. \n\nI'm honestly appalled. They seem embarrassed and ashamed of her, and they want to hide what she did because it makes them look bad in the \"eyes of God\". Fuck man. Wouldn't even let a supportive message and a link to NAMI slip in there. Had to be clean and without any reference to mental health whatsoever.\n\nI feel so bad for her. If her parents made \\*me\\* feel this invalidated in one fell swoop, I can't imagine what her life was like with them.\n\nJust needed to vent, thanks for reading.",
    "source": "Reddit",
    "timestamp": "2020-12-06T04:28:29",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "The more I educate myself in psychology the more I believe that there isn’t such a thing as laziness I feel like most things people call lazy are depression, avoidance behavior or anxiety like fear of failing or executive dysfunction.",
    "source": "Reddit",
    "timestamp": "2022-07-19T17:50:25",
    "user_id": 4637182848845731317,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I'm 84 days clean from sh and don't have anybody to tell Sorry if this isn't the right place but I just want to share my \"achievement\" with anyone so that it actually feels real and I wanna try be a bit proud of myself\n\n   ¬Guys, thank you for the support I can't explain how grateful I am y'all made me smile today thank you",
    "source": "Reddit",
    "timestamp": "2024-07-21T00:10:34",
    "user_id": -7381377876797205923,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Today marks 3 months safe from self-harm. ♥️ Don’t be ashamed of the past—celebrate all victories.",
    "source": "Reddit",
    "timestamp": "2020-12-16T15:16:49",
    "user_id": 3422830698617884650,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Read this, you need to hear it whoever you are. This is a sign. Wherever you are, whoever you are - we hurt ourselves because we obsess about the end of our journeys. Focus on staying in the moment, on being grateful for where you are today. Let September be September, let October be October and let yourself just *be*, even in the uncertainty. You don’t have to fix everything. You don’t have to solve everything, you can still find peace and grow in the wild of changing times. Everything will be alright. Trust me. Climb out of your head and into the moment. Be proud of how hard you’re trying.",
    "source": "Reddit",
    "timestamp": "2020-09-22T20:09:04",
    "user_id": 5659369852972512519,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I did acid when I was 17 and have been feeling dead inside since then When I was 17 I decided to take acid with my friends and I ended up going through a traumatic bad trip that some may call \"ego death\", my subjective self was basically fading away and I felt like I was dying and literally entering vegetative state as I just couldn't remember how to speak who I was nor what my purpose was.\n\nWhen the trip was over I was fine but still in shock.\nThen after a few weeks I started having ptsd and anxiety attacks that made my life hell. Now fast forward a few years and I just feel depersonalized all the time, like I'm not there. Of course I can ground myself, but sometimes I just get disconnected from reality, go through derealizations and feel like I'm just a little man watching my life through the lense of my eyes.\n\nHave anyone gone through similar things ? Please help me\n\nAlso if you're contemplating doing psychedelics and you're below 25, please don't, what people say is true, don't gamble losing yourself for 3 hours of pleasure",
    "source": "Reddit",
    "timestamp": "2025-01-04T22:29:43",
    "user_id": 1533836768221040032,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I fell asleep under a tree, and it fixed me Got done with work early and took a nap under a tree. It was only like 15 min but I Highly recommend it. Take a nap in nature, this is the way. ",
    "source": "Reddit",
    "timestamp": "2025-03-17T20:27:09",
    "user_id": 7193163382772869336,
    "subreddit": "mentalhealth"
  },
  {
    "text": "After 9 years of homelessness I have a roof over my head and feel good. I am 30 years old man from germany with abitur and have been homeless since 2011, that is until last febuary. I guess I have mental health issues but im not in therapy at the moment, the current situation put that a bit on the back burner. But in the past I hated myself and attempted to end my life on a handfull of occasions, getting always closer to breaking and doing it.\n\nMaybe three month ago I was approched by a social worker and he helped me find my way to a home for young men in rough situations in just a couple of weeks. It is still hard to belive how easy that was. For about a month and a half I just kinda houng out and got acclimated but kept some of my old habbits up (not drugs, just kinda being aimless). With Corona crashing the party, I spend all of my time at home and lazed around.\n\nBut this week I started to work in the extensive garden. Planting crops, installing watering systems and stuff. Today I planted 100+ onions, waterd some salat and cleaned up a volleyball field. I felt good doing that. Then I had myself a nice cold shower and sat down to write this. Im happy right now. Im happy that I enjoyed work. I put the fear that all this shit in my life was because Im just lazy behind me. I enjoy working. Im crying.",
    "source": "Reddit",
    "timestamp": "2020-04-09T12:28:25",
    "user_id": 5322710482542981610,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I ate today! It was a happy meal but I ate, and i was able to brush my hair! :)",
    "source": "Reddit",
    "timestamp": "2020-09-05T03:36:10",
    "user_id": -2225694242390586868,
    "subreddit": "mentalhealth"
  },
  {
    "text": "PLEASE READ THIS. DONT SKIP OVER IT. You are loved, you are needed. My messages are open for anybody who needs someone to talk to. This earth needs you, you make this place better for so many people.",
    "source": "Reddit",
    "timestamp": "2021-06-14T09:37:36",
    "user_id": -6554375448726829895,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Is it just me or did everyone's mental health has gotten severely worse since the quarantine? My mental health is falling like snow.",
    "source": "Reddit",
    "timestamp": "2020-04-08T08:30:11",
    "user_id": -8174181916554619931,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I did it guys.  I've been struggling with my mental health since I was 12 years old. I am diagnosed with depression, anxiety, bipolar disorder, adhd, ocd, and ptsd. Today I'm sitting in my new apartment. I moved in a week ago. My beautiful son (who admittedly is the result of a manic episode but I have no regrets) is sleeping in the room next door. My bills are paid and I have no worries about keeping them paid. I never thought I would be stable enough to live on my own. For the past 10 years it's just been hospitalization after hospitalization. 13 hospital visits and 7 attempts later I thought there was no hope for me. But I did it. I love my job. I love my friends. I love my son. I love my life. And I'm going to keep fighting as hard as I can to maintain this. Not just for my son but for me, because I deserve to be happy. I deserve to feel safe. It took me a very long time to realize that but I know it's true now. ",
    "source": "Reddit",
    "timestamp": "2024-05-07T00:13:15",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "I'm no longer suicidal ! The title says it all. It was by no means easy but I'm happier with myself again.",
    "source": "Reddit",
    "timestamp": "2020-10-01T09:43:53",
    "user_id": -8028841792246331157,
    "subreddit": "mentalhealth"
  },
  {
    "text": "don’t you just love how mental disorders are basically buy one get seven free ",
    "source": "Reddit",
    "timestamp": "2018-10-30T10:45:19",
    "user_id": 5155885530524939488,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My cat stopped me from committing suicide. Today something very weird happened. I began to have very suicidal thoughts, but my cat stepped in. You may think i’m making this up but i’m not i swear.\nTonight I held a knife to myself, and my cat ran to my side. At first I thought he was just trying to cuddle or get me to pet him, but I then noticed instead of rubbing into my hand, he was pushing the knife away. I broke down into tears and he immediately climbed into my lap. I moved and he laid beside me, and now refuses to let me out of his sight. His little paw is sitting on my arm, and when i move he moves. This is insane, but he stopped it, if it wasn’t for my cat i’d be dead. I can’t thank him enough, he’s my angel baby. I love him so much.\n\nUpdate: I’m better, I decided to stay for him. Mentally I’m not okay, but I’m working on myself and I will get better soon. Thank you all for the love and support! Ive been getting more love from strangers than I get from friends and family. It means the world to me.❤️\n\nEdit: I will not be showing pictures of my cat. Not in a mean way, but in a way for my privacy. I came on here to be “anonymous” in ways, just so if someone i personally know comes across this they can’t tell it’s me. Thank you for all the support, it means a lot. I just wanted to share what saved my life last night.\n\nAnother Update: Hi! so I wanted to come back on here and give y’all a new update. First off, thank you ALL for so much support and love! It means the world to me, for a few weeks I kept coming back to this post. Basically, I’m doing amazing. I have new school opportunities, a new relationship, new friends. My life has truly turned around. I got out of my toxic relationship, healed, found to love myself again, and now I’m loved by the most amazing guy. Thank you all, you helped me all through a very hard time! If anyone feels the way I felt in this post, please, feel free to reach out to me, call help, trust me on this. I’ve had to do it, it’s not scary trust me. But my messages are totally free for anyone who needs anything! Much love!",
    "source": "Reddit",
    "timestamp": "2022-06-26T07:04:48",
    "user_id": -118172499787462388,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My mom broke up with me for Donald Trump chunky silky lavish faulty hat employ birds special plants cable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
    "source": "Reddit",
    "timestamp": "2020-11-17T13:09:21",
    "user_id": 1713751017902912577,
    "subreddit": "mentalhealth"
  },
  {
    "text": "1 week free from selfharm! I thought I'd share it here.",
    "source": "Reddit",
    "timestamp": "2020-07-22T13:52:50",
    "user_id": -699374573501403481,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Does anyone else feel okay but then one thing just shatters you’re vibe and you go numb. like i was scrolling through tiktok and i was going to send one that i thought was funny to my friend but then realized that i was probably being annoying and a burden so then you feel horrible and go numb like you don’t really have any emotions even though things that should make me sad are running though my head so you just lay there then when you go back on tiktok it feels that you’re not really there. i dont how to explain it exactly.",
    "source": "Reddit",
    "timestamp": "2020-07-09T11:32:01",
    "user_id": 118553204551241136,
    "subreddit": "mentalhealth"
  },
  {
    "text": "27 days cut free and I trusted myself long enough to shave my legs. I am smoooooooooth. And no nicks! ",
    "source": "Reddit",
    "timestamp": "2018-05-06T05:50:27",
    "user_id": 7175695249936786437,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Brain cancer at 16… I’m a mess now. Became extremely I’ll at 16 and told my mom “this is gonna be my last birthday.” I said that 4 days before I was told I have brain cancer. Emergency surgery was done to save my life and I’m 21 now. Been cancer free for a few years but the experience still haunts me. Nightmares and panic attacks are common now, and I constantly need reassurance from my family that I’ll be okay. Nerve pain in my skull and my obvious scar are constant reminders of the worst days of my life. My type of cancer can come back up to 10 years after treatment which terrifies me. I’ve recovered physically but not mentally. Any advice helps a lot <3",
    "source": "Reddit",
    "timestamp": "2023-11-10T22:18:46",
    "user_id": -1811930778646099783,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I need to tell someone that I've been clean for almost a year and I'm so proud but its also the only thing keeping me going Its been almost a year that I've been clean from self harm. I'm so proud but also I'm only keeping going because of how much this means to me",
    "source": "Reddit",
    "timestamp": "2020-11-02T23:35:42",
    "user_id": 1119873285200558493,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Anyone else get these short waves of getting all pumped up to do more stuff in life? But then 10 min later remember that basically life is pointless. Depression sucks",
    "source": "Reddit",
    "timestamp": "2019-05-05T17:17:00",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "I did it. I graduated. I didn’t let depression win. Depression took over but I won.",
    "source": "Reddit",
    "timestamp": "2023-06-14T15:15:05",
    "user_id": 7743143806252128955,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I made it 24 hours without cutting myself or drinking I feel like shit but at least I didn't turn to a knife or the bottle, that's gotta count for something. \n\n**EDIT:** Thank you so much for your kind comments, I'm feeling a bit better and I think I may have found a better outlet for my emotions tonight. I hope you all have a better day or a good night. ",
    "source": "Reddit",
    "timestamp": "2019-01-15T10:25:40",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "“Depression is being colourblind and constantly told how colourful the world is.” - Atticus ",
    "source": "Reddit",
    "timestamp": "2019-12-06T10:45:11",
    "user_id": 3025741649289181067,
    "subreddit": "mentalhealth"
  },
  {
    "text": "unpopular opinion - mental health should be talked about, not normalized. I, as someone with diagnosed anxiety, shouldn't be told every five seconds \"everyone has a bit of anxiety\" Thanks Karen, but i wouldnt have a diagnostic if it was 'a little bit' of anxiety.",
    "source": "Reddit",
    "timestamp": "2022-11-12T17:24:00",
    "user_id": 3293288406984781273,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Live, Laugh, and Love ",
    "source": "Reddit",
    "timestamp": "2019-10-06T01:42:23",
    "user_id": -3251332200920453866,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Does anyone else get surprised when someone likes you as a person? I’m so insecure about my personality that I find it surprising when people tell me they enjoy my company and actually want to hang out. I’ve grown up feeling like I’ve had a boring personality & I get really confused about what people see in me that they like. Does this happen to anyone else?\n\nedit: thank you everyone who commented on this post, I’m glad that I’m not alone in feeling this way :)",
    "source": "Reddit",
    "timestamp": "2021-07-14T01:25:03",
    "user_id": -8248844314033256250,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Yesterday, I did 4 college assignments. Today, I did 5. i’m proud of myself. motivation has been hard this quarter.",
    "source": "Reddit",
    "timestamp": "2021-03-08T23:34:49",
    "user_id": -6446440716667712734,
    "subreddit": "mentalhealth"
  },
  {
    "text": "After putting off my driver’s license for four years due to my depression... I passed my test today!!!!!! 🥳 ",
    "source": "Reddit",
    "timestamp": "2019-06-28T18:09:50",
    "user_id": -3478345913099134381,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I chose not to die. I left loaded weapons on the table and walked to the hospital. I’m 38. I’ve been sober since 2018, married with a child, and on paper I’m doing well—career, family, stability. But inside, I’ve spent years quietly falling apart.\n\nMy first serious crash was at 22. I had gotten a girl pregnant, and before we could talk about it, she had an abortion without telling me. That destroyed me. I fell into a depression I couldn’t explain to anyone. I stopped going to class. I isolated. I drank. A lot.\n\nOne night, drunk and desperate, I emptied my bank account ($3,000) and bought a one-way Greyhound ticket to L.A. I never made it—I got robbed at the terminal, then arrested. The cops took me to a psych ward instead of jail. That might have saved my life.\n\nEventually I finished college. In 2011 I worked in Afghanistan with the military. We got hit with rocket attacks regularly, but I barely reacted. I wasn’t brave—I was numb. Nothing outside felt as intense as what was happening inside me.\n\nAt 27, I lost my job and ended up hospitalized again after another depressive spiral. The suicidal ideation had become familiar by that point. It would creep in and take over until I couldn’t tell if I was in danger or just tired of existing.\n\nI didn’t stop drinking until I was 33. One morning, I left for the hospital with loaded weapons sitting on my coffee table. I made a choice not to die that day—and I’ve never forgotten it.\n\nA doctor told me I had cirrhosis. That scared me sober. A year later, a liver specialist told me it was alcoholic hepatitis and that I’d recovered. Somehow, my body gave me a second chance.\n\nSince then, I’ve stayed sober. I’ve been diagnosed with Major Depressive Disorder, and I’ve tried different meds. Some helped. Some triggered what I can only describe as months of euphoria. I spent thousands of dollars on Pokémon cards. I told myself it was “investing,” but really, I was spinning out.\n\nWhen I crashed again, I ended up in the hospital for a week. The idea of bipolar has been brought up, but nothing formal. I don’t know what I am—other than confused.\n\nNow, even with meds and sobriety, I’ve started raging at the smallest criticisms. It’s like this explosive anger just erupts from nowhere. I hate how it makes me feel. I hate the way it affects my wife and kid. I want to stop, but I don’t fully understand what’s happening inside me.\n\nI’m doing everything I can. Therapy. Psychiatry. Meds. Honest reflection. And still—some days I feel like I’m right back on the edge I was at 10 years ago.\n\nI guess I’m writing this because I needed to say it out loud. I don’t have a clean ending or an insight to offer. Just this:\n\nI’m still here. Still trying.",
    "source": "Reddit",
    "timestamp": "2025-04-05T14:06:31",
    "user_id": 6482596737833936764,
    "subreddit": "mentalhealth"
  },
  {
    "text": "This is what suicidal looks like ",
    "source": "Reddit",
    "timestamp": "2017-12-14T05:09:35",
    "user_id": 2164855369098842102,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Personal hygiene is exhausting with depression. Who can relate? does anyone else feel absolutely exhausted trying to take a shower? i get breathless mid-way and my limbs basically feel like barbells, i always have to keel over to catch my breath. i know it’s not the heat because i shower with room-temp cold water. \n\nfor something i’ve done every single day of my life with ease, now it feels like a marathon. not to mention brushing my hair and teeth in the morning too. \n\ncan anyone else relate? has anyone managed to uncover hacks that make personal hygiene easier during depressive episodes? \n\ni’m fuckin exhausted man. 😩",
    "source": "Reddit",
    "timestamp": "2020-08-10T14:42:35",
    "user_id": -6748234477223712252,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My Rapist is finally going to prison! I feel like a huge weight has just been lifted off of my shoulders. By no means is my suffering over but it feels like things are about to get better for me. I don’t want to get my hopes up but I can’t stop crying, I’m so god damn happy and I love this feeling. Just wanted to tell someone because I don’t have many people to talk to about this and I just wanted to express my gratitude for everything that happened today!\n\nEdit: hai guys thank you SO fucking much for all of the support and best wishes. I appreciate you guys so much and you made my day so much better. This is a huge day for me and if you, ladies AND gentlemen, were sexually assaulted, harassed, abused don’t be afraid to report those motherfuckers!",
    "source": "Reddit",
    "timestamp": "2021-11-30T20:55:07",
    "user_id": 225183104741068058,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I did it. Im six months clean today 😁 I really did it\n\nEdit: holy heck! Almost 200 upvotes in two ish hours and two awards which I’ve never gotten here at all! Thank you so so much for the sweet messages it really means a lot! \n\n(I’m sooo Proud of all of you lovelies as well! Keep fighting you Kings/Queens/Rulers got this!) ❤️❤️❤️",
    "source": "Reddit",
    "timestamp": "2020-06-14T22:49:39",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "My cat saved my life today Trigger warning: suicide\n\nToday I was in tears and closed my bedroom door and started tying a hangman’s Knot. All of a sudden my cat stuck his paw under my door and grabbed the rope, pulled it all under and ran away with it. I know he was just trying to play but he made me stop and think about everything I have. He changed my mind. I know it’s cliche but my rescue cat really did rescue me.",
    "source": "Reddit",
    "timestamp": "2019-05-20T17:42:43",
    "user_id": 5185135369213606089,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I finally managed to clean up my room after I've been struggling with my life for the past few months. It got pretty bad and I somehow gained the energy to do it. I'm very proud of myself :) :)\nEdit: omg everyone is so nice, thank you for your kind words 😭",
    "source": "Reddit",
    "timestamp": "2020-12-25T05:06:40",
    "user_id": 5752101626624537688,
    "subreddit": "mentalhealth"
  },
  {
    "text": "just left r/SuicideWatch :) it’s the main reason i downloaded reddit in the first place so i’m really proud of myself. things are looking up.\n\nedit: i’ve been off of reddit for so long and i never in a million years expected to come back to such a wave of support. i love you all, thank you. i wish i could respond to every single one of you, i just want you to know how much your support means to me. \n\ni’m doing even better now than i was when i made this post. things aren’t perfect yet, but i’m getting there. \n\nthank you so much ❤️",
    "source": "Reddit",
    "timestamp": "2020-12-20T18:16:17",
    "user_id": 6302162415572732675,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I’m Not a Loser for Choosing Medication I’m tired of choosing medication being made to look like a regrettable choice. That somehow I’m not as “victorious” because I couldn’t make it without meds. Look, if someone can do it without meds I think that’s great, but I don’t think they should be put on a pedestal as someone who “made it”. I’m a 46 year old mom and dammit I’m just as victorious. Yes I’m on medication for my OCD, depression, and schizophrenia. So what?! I’m still here, my kids still have their momma and to me a win is a win. I hope you don’t feel ashamed if you’re on meds. You shouldn’t.",
    "source": "Reddit",
    "timestamp": "2020-11-20T18:55:36",
    "user_id": -9120409425169691500,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Y’all I am ONE MONTH SELF HARM FREEEEEE! HELL YEAH FOR YEARS IVE DEALT WITH THIS AND THIS IS MY RECORD! Yeeeeeee!",
    "source": "Reddit",
    "timestamp": "2020-08-11T18:14:38",
    "user_id": -5812537558565403833,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Does anyone else get angry about how much effort you have to put in to stay stable? I woke up exhausted, feeling like sand was holding me down. \n\nBut I knew the sand wasn’t real. I was capable of being a function human, so I decided to be one. I got out of bed, showered and brushed my teeth, I put on clothes and left the house briefly to shop. And then I binge ate crap food, drank vodka, watched 10 hours of tv whilst taking lots of pain meds for back trouble. \n\nI’m not really sure what I’m trying to say. I guess I want people to know that I tried. I fought back at my body and forced myself up, forced myself to do the bare minimum of existing and damnit - I was so proud. I want the satisfaction of ‘doing the healthy thing’ even though it was hard, and then I want the reward to be a sudden ability to live easily. \n\nBut it didn’t come. I gave in to the dull ache of sadness and consumed sugar, salt and digital crap until I felt sick. I’m back in bed now thinking about every mistake I made today and how I wish I was stronger. \n\nI know that a path back to a healthy mental space/ lifestyle is going to be a long, hard road after neglecting it for so long. And I know I have to do it, and do it now before it deteriorates further. I just wish it wasn’t so intensely challenging. I wish that I didn’t have to eat healthily, exercise, keep a tidy house, be social JUST TO STAY AFLOAT.\n\nMissing a run means missing on the happy endorphins I rely on to keep me going through the day. Having an unhealthy meal makes me sluggish, that in turn makes me feel that tiny bit worse which is enough to make me not do chores. I hate being in such a fragile state where i’m not quite mega-depressed, just always on the verge of not leaving my bed for 48 hours. \n\n\nTL:DR Life is hard, I like easy things. Nothing worthwhile comes easily.",
    "source": "Reddit",
    "timestamp": "2020-05-27T20:54:21",
    "user_id": -651350092480621028,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Celebrating 6 months since I stopped cutting 🥳 Yay",
    "source": "Reddit",
    "timestamp": "2020-03-05T19:02:56",
    "user_id": -7389346459840271308,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Does anyone else feels like their mental illness make them stupid/forgetful? I feel like in general I have become more forgetful, spacey, and just stupid. \n\nI have depression that, I think, has gotten worse over the years. I also have GAD, and every day after dealing with both I just feel so exhausted and braindead.\n\nI can't remember things anymore, I feel like I don't think properly, and I'm worried that people are starting to think less of me because of it.\n\nDoes anyone else feel this way? How did you overcome it?\n\n\nUpdate: WOW. I did not expect for this to blow up. Thank you all so much for sharing your experiences and kind words. I made this post after my mom got mad at me for forgetting to get gas in my car. Essentially she made me feel useless, and called me horribly irresponsible. On top of that I forgot to shut the door of the garage (luckily my sibling was able to help me before my mom noticed)\n\nAlso to answer some questions that gave come up:\n\nI am not on any medications\n\nI exercise daily (those stationary bikes are awesome!)\n\nI live in a very stressful home environment.\n\n\nI've seen a lot of helpful solutions, especially the one about getting a planner! Thank you all again. I have read all of your comments and appreciate you all so much <3",
    "source": "Reddit",
    "timestamp": "2020-09-08T16:56:02",
    "user_id": 6385327710319420441,
    "subreddit": "mentalhealth"
  },
  {
    "text": "Do you ever feel like the more you learn the more depressing the world is? Ignorance truly is bliss.",
    "source": "Reddit",
    "timestamp": "2020-07-18T20:35:42",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  },
  {
    "text": "Hey... so... is anyone else too afraid to leave the house because they don’t want to be seen by other humans and they just want to be invisible? I want to be invisible as I feel so uncomfortable i can’t go out without feeling horrible. And of course you try and be brave and go out but instead you end up feeling terrible or have a panic attack in public instead? Or... \nIf anyone has any way to overcome this... it would be appreciated. I know the only way to over come it, is to keep going out. But it mostly ends up with me feeling awful and low or I just panic and cry... i mean I’ve been picked on most of my life by school kids and teens. And just people in general. Okay thanks.",
    "source": "Reddit",
    "timestamp": "2020-06-14T00:23:07",
    "user_id": 496596888648428272,
    "subreddit": "mentalhealth"
  },
  {
    "text": "My ex sent me a video of her having sex with another man. So just recently today I received a video from my ex and in the video she was performing a sexual act. I honestly am a little hurt and not feeling ok. How does a person even react to this. What should I even do I just never experienced this before.",
    "source": "Reddit",
    "timestamp": "2024-04-28T23:19:24",
    "user_id": 2000881271569525418,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I am looking for someone who helped me years back with my eating disorder. If it's you please let me know. I really hope you see this.\n\nI'm. Not sure if it's even this subreddit but I'm trying my luck. \n\nI lost my old account and don't remember it at all, because I changed my phone alot within those times.\n\nI was a 16 years old male with Bulimia Nervosa, I opened up here about my issues and alot of you good folks helped me. \n\nA random user reached out to me and started helping out, by giving me advice and opened up to me about her own problems. She gave me a place to vent and someone to reach out to. \n\nNow I haven't been bulimic for the last 2 years (20 now), I did it solely from education and will which I'm proud of, because proper therapy is not accessible here. I started exercising, and educated myself alot about nutrition and physical health, I sometimes relapse, but very rarely (once a day every couple of months or so). And she definetly helped me alot. And I want to thank her, and talk to her. Oh Boi do I have alot of stories to tell her about (unfortunately not all are good). \n\nShe is a married middle aged woman with kids, she is Pyromaniac, would talk to me about it and  about her daily routine of how she handles it. \n\n\nIf it's you, i'd love for us to chat again.",
    "source": "Reddit",
    "timestamp": "2020-10-19T02:40:35",
    "user_id": 8064047294896407985,
    "subreddit": "mentalhealth"
  },
  {
    "text": "I witnessed the self immolation in NYC the other day. Basically the title. I was close enough that I felt the heat and am in some of the videos going around (barely). I saw and heard it all. I didn’t realize what was happening until after he lit himself and it was too late. I didn’t film, I stood there stunned and watched. I don’t know why I watched and I wish I didn’t because what I saw is going to haunt me forever. I don’t want to go into details but I was throwing up for a few hours after and I haven’t been able to sleep without the help of a lot of Valium and alcohol. I saw my therapist for an emergency appointment but I think it’s too soon for anything to help. \n\nI don’t even know why I’m writing this. I feel selfish for being so upset about something that didn’t have anything to do with me. I feel so sorry for that man. I watched him experience one of the most painful ways to go. I also feel mad at him. People shouldn’t have had to see that. I’m young which means I’m going to be stuck with the sight and sound and smell of him burning for the next 60 something years of my life. Fuck, man.",
    "source": "Reddit",
    "timestamp": "2024-04-22T02:36:20",
    "user_id": -459290626317599623,
    "subreddit": "mentalhealth"
  },
  {
    "text": "A friend sent me this poem yesterday, I didn't realize how badly I needed to hear this. If the mountain seems too big today \n\nthen climb a hill instead \n\nif the morning brings you sadness \n\nit’s ok to stay in bed \n\nif the day ahead weighs heavy \n\nand your plans feel like a curse \n\nthere’s no shame in rearranging \n\ndon’t make yourself feel worse \n\nif a shower stings like needles \n\nand a bath feels like you’ll drown \n\nif you haven’t washed your hair for days \n\ndon’t throw away your crown \n\na day is not a lifetime \n\na rest is not defeat \n\ndon’t think of it as failure \n\njust a quiet, kind retreat \n\nit’s ok to take a moment \n\nfrom an anxious, fractured mind \n\nthe world will not stop turning  \n\nwhile you get realigned \n\nthe mountain will still be there \n\nwhen you want to try again \n\nyou can climb it in your own time \n\njust love yourself til then",
    "source": "Reddit",
    "timestamp": "2019-02-20T15:20:46",
    "user_id": 8485621294651320061,
    "subreddit": "mentalhealth"
  },
  {
    "text": "i finally showered and brushed my teeth after a depressive episode i’m so proud of myself even thought it doesn’t sound like much, it was just so so unbelievably hard to do something other than lay in bed and sleep. i want this to stand as a success story for people that are ashamed of not doing basic things because of their illnesses, and that every success is amazing. comment with your recent successes!",
    "source": "Reddit",
    "timestamp": "2019-10-04T17:09:09",
    "user_id": "anonymous",
    "subreddit": "mentalhealth"
  }
]